[
  {
    "_id": "/2AR",
    "body": "",
    "name": "2 Adams",
    "parentid": "Root",
    "type": "staircase",
    "weight": 4
  },
  {
    "_id": "/H",
    "body": "H staircase is on Front Court. Like I staircase, it has no exit all the way to the bottom because of the auditorium, so you need to use J or G instead.",
    "name": "Staircase H",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/1S",
    "body": "If you're lazy, Sylvester's a bit of a trek - adds a few mins to any journey to Sidgwick or Town. Then again, it's right next to a fairly decent bike shed, which takes much less time to get to than in college.\n\nAlso, there's a huge car park, so moving in and out is hassle free.",
    "name": "1 Sylvester",
    "parentid": "Root",
    "type": "staircase",
    "weight": 3
  },
  {
    "_id": "/F",
    "body": "F staircase is on Herschel Court. Kitchens are in the basement and on the 4th floor.",
    "name": "Staircase F",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/C",
    "body": "C staircase is on Herschel Court. Kitchens are in the basement and on the 4th floor.",
    "name": "Staircase C",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/",
    "body": "This is the website which will be used to manage the RCSA room ballot.\n\nIf you're a current student not already logged on I recommend you start by logging in so you can view allocations for all rooms.  These will then be updated in real time during room ballots etc.  To log in, simply click the link at the top left of the browser window.\n\nOnce logged in, you can use the check box at the top to choose between viewing the current allocations (to find out what room your friend's in or remember the name of the guy who lives next door) and next years allocations (to help you choose a room during that stressful balloting period)\n\nYou can use the gold bar to navigate between the staircases and houses and the light yellow bar to see more detailed information about a specific room.\n\nTo view all the rooms and their availability select Home from the first menu then Projector from the second menu\n\nYou can edit the descriptions of rooms and staircases and I encourage you to add lots of helpful information/reviews.  It would especially be great to see people adding photos for their rooms.  Make sure you click save when you're done or you will lose all your work.\n\nThe editing is done using markdown syntax which is fairly simple (just look at other rooms for examples).\n",
    "name": "Home",
    "parentid": "Root",
    "type": "page"
  },
  {
    "_id": "/J",
    "body": "J Staircase is on Front Court. It also has a function room, J8",
    "name": "Staircase J",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/K",
    "body": "K Staircase is on Long Court. It also has a nice lift. The SCR is on K Staircase.\n\nThe college's darkroom is on K Staircase (labelled \"Linen Room\"). It hasn't been used for many years.",
    "name": "Staircase K",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/P",
    "body": "P Staircase is on Long Court\n\nThere is a decent kitchen on the top floor and a very nice one at the bottom of the staircase.\n\nLocation wise, it is above the Cafe, and very close to the Garden Restaurant and then Bar.",
    "name": "Staircase P",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/E",
    "body": "E staircase is on Herschel Court.\n\nKitchens in Basement and on 4th Floor",
    "name": "Staircase E",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/1AS",
    "body": "There is no description for this staircase, why not consider adding one?\n\nGround Floor\n------------\n![Ground Floor Plan][1]\n\nFirst Floor\n-----------\n![First Floor Plan][2]\n\nSecond Floor\n------------\n![Second Floor Plan][3]\n\n\n  [1]: http://i.imgur.com/QcCxI.png\n  [2]: http://i.imgur.com/YBhkk.png\n  [3]: http://i.imgur.com/uckFs.png",
    "name": "1A Sylvester (Grad House)",
    "parentid": "Root",
    "type": "staircase",
    "weight": 4
  },
  {
    "_id": "/O",
    "body": "O Staircase is on Long Court",
    "name": "Staircase O",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/B",
    "body": "B staircase is on Herschel Court. Kitchens are in the basement and on the 4th floor.\n\nParents particularly like B staircase as it's right opposite the Herschel Road gate, making it very nice to move into.",
    "name": "Staircase B",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/M",
    "body": "M Staircase is on Long Court",
    "name": "Staircase M",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/L",
    "body": "L Staircase is on Long Court and is near enough exactly between the plodge and the canteen, which is great!",
    "name": "Staircase L",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/N",
    "body": "N Staircase is on Long Court",
    "name": "Staircase N",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "name": "Projector",
    "parentid": "/",
    "type": "special",
    "weight": -100,
    "_id": "/projector",
    "body": ""
  },
  {
    "_id": "/Q",
    "body": "Q staircase is on High Court.\n\nQ staircase has a lift, which is very useful for moving in and out each term (and getting to brunch when it's raining!). There are also two guest rooms and the IT office is based on the first floor. It was refurbished in Summer 2013.",
    "name": "Staircase Q",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/1AS/1AS-24",
    "allocations": {
      "2012": "Joe He",
      "2013": "Yasmin Cazorla Bak",
      "2014": "Patrick Frost"
    },
    "bathroomsharing": 0,
    "body": "**The room:** The room is pretty damn huge for a Standard, and is a mirror-image of room 21. It has a sloping ceiling (very low at one side, and very high at the other). Most of the usual things are here -- notice board, desk, bed, chair, coffee table, desk lamp, built-in wardrobe with draws, bed-side table, bookcase. In addition, there is a sink and a big lamp, but there isn't a kettle (nor is there in any room in the house). With two lockable cupboards, there is plenty of holiday storage space. There are 4 pairs of plug sockets dotted around the room, but you'll still need an extension lead if you have lots of chargers or things like that.\n\n**The window:** One of the walls of the room is a window. Quite a tall pane of the window opens, but not very wide, so the room can get hot when it's sunny -- the window is South-facing so you get sun from dawn 'till dusk. There are blinds rather than curtains because of the weird shape of the window, so sometimes you can get woken up early by daylight in the summer. You can't fully draw them either, instead you can only swivel them. Cons aside, the window's pretty good most of the time, and it's very nice having a light room (particularly compared to the other top floor rooms except 21, which have one tiny window and are quite gloomy).\n\n**The floor:** The rooms on the top floor of the house are bigger than the ones on other floors, as they fit three rooms into each side of the house rather than five. There are two bathrooms (one on each side) and a kitchen at the end. The kitchen is a bit smaller than the floors below and has a crazy ceiling which you won't appreciate if you're any taller than about 5'8\", but it contains a separate fridge and freezer, as well as a proper oven with real hobs. There's lots of storage in the kitchen and a table with chairs too. It's ideal if you like cooking. The baths/showers are temperamental: if you go in on a bad day then the tap will sputter and no water will come out of the shower. On a good day, it's fine... whatever, you get used to it.\n\n**The house:** The house is located behind 1 Sylvester and 6 Adam's, and is about 2-3 minutes' walk away from the plodge. It's nice walking through the gardens to go places, but make sure you have an umbrella for those rainy days. Soundproofing isn't great, so if you want to sleep and someone's having a party, you should just join the party because you don't have a hope in hell of sleeping. In fact, the house is ideal for parties, especially if you're friends with the people who live around you. The house doesn't have Wi-Fi, and won't for the foreseeable future, so make sure you have an Ethernet cable. A nice thing about the house is that the rooms are fairly uniform, so you won't get lumbered with a horrible room whilst your neighbour lives in a luxurious pad.\n\n**The locality:** Being 'far' from college is made easier by the laundry room in the 4 Adam's outhouse and the bike shed just opposite the front door. The laundry room is fit for purpose, but the college machines are faster, bigger and overall more effective, so making the trek across the gardens can sometimes be worth it. The house has two gardens, one of which is shared with 1 Sylvester and the other of which is behind 5 Adam's garden. The driveway of 1 Sylvester is very convenient for moving in and out if you arrive by car.\n\nI've been pretty comprehensive (three cheers for procrastination!), but if you want to ask any questions, email me (cn319). I can't arrange for you to look round since I don't live here any more, so your best bet if you want to see it is to buzz the room and hope somebody nice lives there.\n\nClive (inhabitant of room 24, 2010-11)",
    "floor": 2,
    "name": "Room 24",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R",
    "body": "R Staircase is on High Court",
    "name": "Staircase R",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/S",
    "body": "S Staircase is on High Court",
    "name": "Staircase S",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/6AR/6AR-8",
    "allocations": {
      "2012": "Unavailable",
      "2013": "Rebecca Schofield",
      "2014": "Leo Cotterell"
    },
    "bathroomsharing": 0,
    "body": "This room is on the same floor as one of the kitchens, and two toilets (these are quite small, but both of them have sinks in the same room). The bathroom is large on this floor is large. This room is south facing - so good if you like lots of sunlight (not so good if you don't like being hot in the summer). This is probably one of the smallest standard rooms owned by the college. It's in a different section of the house to the bathroom, toilets, and kitchen, so these usually aren't heard in this room. \n\n\n_________________________________\n\nIt's not huge, and the internet box is in an awkward place, but if you arrange the furniture and decorate it nicely then it's very cosy and never cold. The furniture is not the same as in college (smaller wardrobe, chest of drawers, different coffee table, set of bookshelves rather than shelves on wall) but it's not awful. You get a really big windowsill too. Room 7 next door is like 3 times the size so make friends. Noone bothers you by using the loo/going to the kitchen because they're on the other side of the hallway. The house overall is a bit grotty but perfectly inhabitable.",
    "floor": 1,
    "name": "Room 8",
    "parentid": "/6AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/allocationEdit",
    "body": "This page allows you to edit allocations.  Be very careful to ensure you are editing allocations for the correct year.  The year can be changed using the check-box in the header of this page.  To choose an allocation just enter the name into the text box next to the desired room.  As soon as you press enter or tab away, the change to allocations will be saved.  It is normally seen on other computers within 10 seconds of being saved.",
    "name": "Edit Allocations",
    "parentid": "/",
    "type": "special",
    "weight": 150
  },
  {
    "_id": "/A/A17",
    "allocations": {
      "2012": "Tom Pearson",
      "2013": "Henry St Leger-Davey",
      "2014": "Everest Marshall "
    },
    "bathroomsharing": 2,
    "body": "* Not garden facing, but since it's right on the end of the college it looks out onto the gardens just outside the front of college - better than bricks!\n* Below kitchen, so not too much noise\n* Light: really good light all day... may get annoying in the Summer (i'll let you know!)\n* Storage space: unlike A16 there is NONE.\n* The bedder (if she sticks to the same stair case) is amazzing - an absolute life saver.\n* Kitchen: nice and big with two fridges\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n16/10/2012: Don't know who wrote all of that, but anyway, I'm Tom (trp31) and I'm living in A17 in 2012/2013. Here's everything I can think of to add to that:\n\n* Light: the sun does get in your eyes in the afternoon. Slightly annoying, but you can draw one curtain as necessary.\n* View: I think A16's view of the College gardens is nicer, but it's not terrible - some big trees right outside the window and you can look down onto Herschel Court.\n* Balcony - is shared with B15. Also, nice set of French doors leading out onto it.\n* Kitchen - That guy was lucky, two fridges?! There's only one fridge this year - only two kitchens between 21 people on the staircase means that the fridges do get packed. Also, I'm told that most of the fridges around have a freezer compartment, which was news to me as ours doesn't. Plenty of cupboard space though.\n* Wi-Fi: My iPhone picks up the wireless network just fine, but my laptop can only connect about half of the time. It might just be my laptop though, there are routers throughout the staircase broadcasting the signal so I don't think it's an issue of distance from the centre of College. Which brings us to...\n* Location: It IS a 60-second walk from A staircase to the bar, canteen or anything interesting in College. I'd prefer to live on S than A (or B to F, for that matter!) It's pretty annoying when you realise you haven't brought your card for the JCR and have to trek all the way back over to A :)",
    "floor": 3,
    "name": "A17",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F7",
    "allocations": {
      "2012": "Chi Leung",
      "2013": "Alice Zanghi",
      "2014": "Sam Kaplan"
    },
    "bathroomsharing": 1,
    "body": "The room's south-facing, so it gets quite a lot of light. It also backs onto the 1st floor walkway on Herschel Court, so people do walk past the window every now and again - which is a bit odd but you get used to it. Oh, also, the window opens right up so it can be like a back door if you need to let anyone in from outside. The room's right next to the stairs, 2 floors up from the bottom kitchen. There's not as much storage space as some other rooms, but there is an overhead locker for holiday storage, and there is plenty of floor space.",
    "floor": 1,
    "name": "F7",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/K/K2",
    "allocations": {
      "2012": "Stephanie Ng",
      "2013": "Tom Weir",
      "2014": "Rebecca Lloyd"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "K2",
    "parentid": "/K",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J7",
    "allocations": {
      "2012": "Christopher Rafaluk",
      "2013": "Piya Haria",
      "2014": "Sahil Shah"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "J7",
    "parentid": "/J",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/I/I12",
    "allocations": {
      "2012": "Jonathan Miller",
      "2013": "Joe He",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Not in the most fashionable part of College, but still a deccent room. There's good wireless access, good enough for the iPlayer and whatever else you may use the internet for. There have been a few problems with the bathroom over the year, but that'll hopefully be fixed by the time you'd move in. I've found it impossible to fully shut the window/door onto the balcony, but that seems pretty universal. I was able to fit all my clothes easily into the cupboard, though there wasn't a space to leave things locked up over holidays. The bed can be really easily moved into the corner, which I thought made the room feel a lot more homely...\n\nIts conviently near the Plodge and the Library, but like the rest of block, there are no stairs to the ground floor, so you have to commute up J or H. Annoying when its raining, but you get used to it, like all of life's miseries. You'll make great use of the curtains, as you're at eye level with the computer room, but on the plus side, you get a great view of the flag on the two or three days a year that its flying (and of that one guy that goes to the computer room every night between 02.00 and 02.13), and the warming stare of the UL gives you a constant feeling of authoritarian cosiness.\n\nOn the whole, a good starter home for a young family on the move, or a fresher getting used to University.\n\n---\n\nDisagree with this pessimistic view of such a solid college room. Yeah I hate stairs and it's not fun trekking up to the 3rd floor but it's a cracking central spot above front court which gets 2 hours of solid sun for some sun bathing in the summer.\n\nAlso shares a balcony with J9(tbc?) whose occupant i was greatly indebted to after patching me up following a little tumble through the window onto the balcony. That is also greatly useful for keeping cold beers out on over the winter months...\n\nSo my opinion is that it will almost inevitably be a fresher room, but in the case that it turns out to be occupied by a veteran member of college, just chill out. There are better rooms out there, but there are also defitnitely worse rooms out there too....\n\n---\n\nWatch it you young whippersnapper, I fought a war for you lot!",
    "floor": 3,
    "name": "I12",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C16",
    "allocations": {
      "2012": "Star Tong",
      "2013": "Alexander Berry",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Nice garden view over college with a shared balcony that is really nice to use during the warmer months. Kitchen is just one floor up. Overhead vacation storage is available.",
    "floor": 3,
    "name": "C16",
    "parentid": "/C",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/M/M4",
    "allocations": {
      "2012": "Ayushka Nugaliyadda",
      "2013": "Peter Carey",
      "2014": "Jamie MacNab"
    },
    "bathroomsharing": 1,
    "body": "- Holiday Storage.\n - Typical Ensuite Room.\n - Warm.\n - Near the Bar.",
    "floor": 1,
    "name": "M4",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D8",
    "allocations": {
      "2012": "Jonathan Ellis",
      "2013": "George Ramsay",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "kitchen 2 floors down.\n\nmusicians are put around these staircases.",
    "floor": 1,
    "name": "D8",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J8",
    "allocations": {},
    "bathroomsharing": 1,
    "body": "J8 is a large function room with it's own kitchen.  It is available for students to book out and as such is a great place to hold big group meals or committee meetings.",
    "floor": 2,
    "name": "J8 (Function Room)",
    "parentid": "/J",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/L/L13",
    "allocations": {
      "2012": "Mark McGill",
      "2013": "James Baker",
      "2014": "Ellie Riches"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "L13",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F20",
    "allocations": {
      "2012": "Michael Antony",
      "2013": "Bethany Oakley",
      "2014": "(fresher)"
    },
    "bathroomsharing": 3,
    "body": "There is no description for this room, why not consider adding one?\nI was in there for my first undergraduate year (the 2012-13 academic year). I do not know what the college's refurbishment plans are, but in the future it is quite possible that this description will become redundant.\nThis is a Standard room however for some bizarre reason the bathroom is shared between 3 people. This was surprisingly never an inconvenience (apart from the morning of matriculation). \nApart from this, the bathroom is ok; it contains a shower in which the water temperature output is suitable and the pressure is reasonable. \nThe toilet has a powerful flush. Yet it does stink a little thus it can be annoying if the other two decides to leave the toilet door open.\nThe room size is not bad, but it *feels* smaller than other standard rooms and the desk is not that big. But this wasnt too bad since I like my libraries. If you are a fresher, check out https://www.youtube.com/watch?v=3hjzNNvaELA and our library is open 24/7.\nI like the kitchen, especially the new microwave which suddenly appeared during the year.\nThe best thing about this room is definitely the view of the Garden. That is one amazing view in my opinion, especially in the summer. You will have a balcony! Though the sun never shines on that side apart from in the Easter term when the days are longer.\nThe stairs are not too bad to ascend even if pissed. I am quite unfit and small yet after a few days I was still able to get used to the stairs.\nOh and there is no storage for the holidays.\n\nOverall, this room is not too bad and served me well as a fresher. If you are a fresher; what room you get really doesnt matter, as long as it does the job, which this one does. I hope you have a good year!!\n\nMike :)",
    "floor": 4,
    "name": "F20",
    "parentid": "/F",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G/G8",
    "allocations": {
      "2012": "Max Baxter-Allen",
      "2013": "Hugh Granger",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "An L shaped room and a fairly good size, especially if you rearrange the furniture. No sink, but there is a lockable cupboard over the wardrobe. On the same floor as the kitchen, which is useful. Quite a few stairs. Convenient since its on front court. No wifi. A bit dark- not much daylight, a nice view of the garden though. Shares a balcony with a room on H, it can get a bit cold by the door and windows.\n\nI lived here in 2010-11 - I broadly agree with all that has been said. That stain on the floor isn't sick, my friend dropped something on it. Sorry. There's now intermittent, very weak wifi that is useless for pretty much every purpose. The wardrobe seems to be smaller than some other rooms' as well.",
    "floor": 3,
    "name": "G8",
    "parentid": "/G",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/J/J2",
    "allocations": {
      "2012": "Brian Wang",
      "2013": "Weicong Chen",
      "2014": "Julia Stukalina"
    },
    "bathroomsharing": 1,
    "body": "Really nice room. Straight up one flight of stairs opposite plodge. Ensuite, with amazing shower. Great wardrobe space (3 doors), and tons of holiday storage in the locker above. Garden-facing, although can't actually see them when at desk because the balcony kind of blocks it. Opens on to the large shared walkway at the back of the college. Good daylight, although can get a little dark in the afternoons due to balcony above. I can't access eduroam wifi, although previous occupants have been able to and the internet plug is right next to the desk. Radiator is behind the desk which is annoying for the rest of the room. Kitchen is right next door which is convenient.\n\nOverall really nice, conveniently located room!\n\n(Rob - rab205)",
    "floor": 1,
    "name": "J2",
    "parentid": "/J",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R11",
    "allocations": {
      "2012": "Konstantin Semeniuk",
      "2013": "Jonathan Stephenson",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "One of the L-shaped rooms sharing a balcony with a room on S. The L-shape means the desk area gets a lot of light as it has 2 windows to the side and a balcony door behind it, but there is a nice corner for the bed with very little daylight which is excellent if you want to sleep during the day. The shape also means you have lots of wall space for storing things against. The walls are painted lilac and the carpet is beige / blue.\n\nEven though this is a Standard room it is actually an almost-ensuite. The toilet and bathroom are shared with an office which is only occassionally used, and never for living in, so you can basically treat them as your own. The office is used for supervisions one or two evenings every couple of weeks, but also for start/end of term DoS meetings and admissions interviews so be aware you might get woken up if trying to have a lie-in at the start or end of term. Important to note all this is subject to change if a different Fellow takes over the room, or if the current Fellow uses it differently next year.\n\nStorage: One of the smaller fitted wardrobes (i.e. 2 doors rather than 3) with a lockable cupboard above. Just as well there's a lockable cupboard... as it's on High Court plus two flights of stairs without a lift, moving in can be hard work.\n\nAll in all a very nice room which must be one of the best value rooms in the college building.",
    "floor": 3,
    "name": "R11",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/P/P8",
    "allocations": {
      "2012": "Eleanor Riches",
      "2013": "Benjamin Gates",
      "2014": "Harry Orchard"
    },
    "bathroomsharing": 1,
    "body": "SIZE\n----\nIts a pretty standard room when it comes to size. When you come in you have the Bathroom right in front and the rest of the room to your right. There is a little section in between the two where the wardrobe is.\nIt narrows down in the corner where the desk is but not much.\n\nLAYOUT\n------\nDesk is on the far corner of the room, by the window which is nice, you get lots of natural light and breeze. The bed is on the opposite corner, parallel to the window. \nThe window is facing Long Court, which isnt as good as having a Garden View yes, but at least you dont get disturbed or waken up by that anoying 8am trolly like the people on the first floor. OH and you can see the top of the University Library tower and, guess what, BRICKS! Yeah, lots of them, that is basically your view.\n\nBATHROOM\n--------\nBathroom has a standard layout except for one very annoying thing...The mirror is far from the sink and on a different wall, its just stupid and is probably the only anoying thing about this room.\nShower pressure is ok, seen better, seen MUCH worse. Toilet works fine, no problems whatsoever.\n\nSTORAGE\n-------\nThis is kind of an issue. The Wardrobe is relatively small (2 doors) and so is the overhead storage, if you are like me and have literally tons of stuff to store over the holidays, you will be struggling...\nThe room does leave lots of space for other stuff like for example, I have a large bean bag and 2 trunks which I use to keep my clothes and Sport gear and the room still looks big! You can fit 20 people in here for a proper room party!\n\nOther\n-----\nWhat else can I say about this room... \nDont worry about the noise, you might think since you are right above the bar that it will be noisy, but not at all, at least on the second floor. The radiator works well, perhaps too well. There are lots of sockets all over the place and the internet socket is right where you need it to be.\n\nOverall this is a good room in a great staircase, if you dont mind not having a garden view and just want a nice, quiet, well located, functional standard plus, this is the room for you! Oh! and if you dont mind the University Library tower looking into your soul and using the sink and the mirror separately.\n\nMiguel Barros Brito (mb753)",
    "floor": 2,
    "name": "P8",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-6",
    "allocations": {
      "2012": "Jason Wyatt",
      "2013": "Curtis Bonnell",
      "2014": "Mary Hughes"
    },
    "bathroomsharing": 0,
    "body": "Big room with lots of light (overlooks back and side garden/road). Bathroom next door (although there's no shower) and there's a cupboard in the little hallway which is handy to put stuff in over the holidays. Sylvester 1 in general is a really nice house to live in - feels more like a home than student accommodation! It's also got a good kitchen with 2 hobs/ovens, 3 fridges and a big freezer.",
    "floor": 1,
    "name": "Room 6",
    "parentid": "/1S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B1",
    "allocations": {
      "2012": "Eliza Lass",
      "2013": "Alexander Grafton",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "dark shoebox of a room, in a basement, with a very dark little windowless lifeless yellow bathroom that will make you feel/look like Edward norton in fight club when he hasn't slept for two months. Despite this, the actual room is cosy and always warm, but you will probably have to endure the sometimes lovely and sometimes absolutely infuriating experience of living underneath music students. They have pianos, and they will use them. Also the wardrobe is teeny tiny and so incredibly dark (worlds weakest light above it) that you probs won't be able to see what colour socks you're taking out, but at least it has some storage above it.\n\nThe problem with this room is that, though it looks out into the garden, it's less of a sweeping green view and more of a 'shrouded by bushes' kind of thing- it's in the darkest, most foresty corner of the garden. It is literally never light. It will be forever untouched by the gentle kiss of the sun. Buy some extra lamps. \n\nIt's also next to the kitchen, which is great because you don't have to carry dirty dishes great distances to get to a big sink, but on the other hand this means the kitchen is as gloomy as everything else, with no window and one fridge the size of a tiny suitcase to share between eight. If you're a reptile or the kind of person that needs sun and nice atmosphere to feel at home, you probably won't like this room, but it has its charms.",
    "floor": -1,
    "name": "B1",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/sets",
    "body": "Sets are for 2 people. They come with 2 bedrooms and a bathroom in most cases (except Set 30) To share a set, both people MUST be directly next to each other in the room ballot.\n\n//Use the syntax -allocation:roomID- to automatically insert\n//allocation text.\n//-allocation-current:roomid- and -allocation-next:roomid- \n//are also available.\n\nSet 21\n------\n2nd Floor Oposite Q Staircase\n\n - [A - Value, [allocation:S21A]](#/sets/S21A/)\n - [B - Best, [allocation:S21B]](#/sets/S21B/)\n\nSet 24\n------\n2nd Floor Opposite Development Office on V Staircase\n\n - [A - Value, [allocation:S24A]](#/sets/S24A/)\n - [B - Best, [allocation:S24B]](#/sets/S24B/)\n\nSet 27\n------\n\n2nd Floor, U Staircase, Above Catering and Conference Office\n\n - [A - Value, [allocation:S27A]](#/sets/S27A/)\n - [B - Best, [allocation:S27B]](#/sets/S27B/)\n\nSet 29\n-------\n\nSet 29 is designed for a disabled student and carer if required. If you choose this set in the ballot, the college will be able to swap you into other college accommodation should it be required by a student.\n\n1st Floor, T Staircase\n\n   - [A - Value, [allocation:S29A]](#/sets/S29A/)\n   - [B - Best, [allocation:S29B]](#/sets/S29B/)\n\nSet 30\n------\n\n2nd Floor, T Staircase\n\n - [A - Standard, [allocation:S30A]](#/sets/S30A/)\n - [B - Best, [allocation:S30B]](#/sets/S30B/)",
    "name": "Sets",
    "parentid": "Root",
    "type": "page",
    "weight": 1
  },
  {
    "name": "College Plan",
    "parentid": "/",
    "type": "page",
    "_id": "/collegeplan",
    "body": "[Open Main College Map in new window][1]\n\n[Open Entire College Accommodation in new window] [3]\n![Main College Map][2]\n\n![Entire College Accommodation][3]\n\n\n  [1]: http://robinson-rooms.wikispaces.com/file/view/college_plan_%281%29.jpg/112053687/college_plan_%281%29.jpg\n  [2]: http://robinson-rooms.wikispaces.com/file/view/college_plan_%281%29.jpg/112053687/college_plan_%281%29.jpg\n  [3]: http://i.imgur.com/yHMVS.png"
  },
  {
    "_id": "/J/J14",
    "allocations": {
      "2012": "Rebecca Schofield",
      "2013": "Samuel Allen",
      "2014": "Charles Holland"
    },
    "bathroomsharing": 3,
    "body": "A nice bright room at the top centre of college (J is a good staircase in that it's opposite the plodge and library) with beautiful views of the garden. You share a bathroom between all 3 of you and a balcony with J15 but try and make friends with whoever is in J13 (claim to fame: Nick Clegg's old room) because they have a massive roof terrace. \nThere are a lot of stairs (top floor) which is a pain on moving in/out days but otherwise it keeps you fit. The kitchen is on the same floor which is handy. \nYou're right next to the bathroom (the toilet is separate from the shower and sink) but unfortunately the shower pressure is rubbish (unless they fix that over the summer). \nThere is no overhead storage in this room, so either make friends with someone who has it or use the trunk room. The wardrobe is a good size though. Wifi connection is pretty good.\nOverall it's a really lovely room!",
    "floor": 4,
    "name": "J14",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-8",
    "allocations": {
      "2012": "Bryn Pickering",
      "2013": "Katherine Taylor",
      "2014": "Tom Pearson"
    },
    "bathroomsharing": 0,
    "body": "This room is directly above the front door of the house, with a large set of windows overlooking the driveway, road and Trinity sports fields.\n\nIt is a good sized room for a Value, with everything you'd expect from a college room. It also includes a sink in the corner.\n\nThere is one large kitchen in the house, which can get easily cramped. There's ample cupboard space, but limited fridge space. The dining room houses a large freezer (again, limited space when ~12 people are trying to use it) and a table that can probably take a maximum of 8 people around it.\n\nThere is a toilet directly next to this room, which is great considering it is only really convenient for 2 other rooms - almost feels ensuite!\nThere is one shower, one bath/shower and one bath in the house and 4 further toilets.\n\nYou can also keep some of your things in the bedder's cupboard over the holidays if you're very nice to her :)\n\nSummary\n-------\n\nPros:\n\n - Large for a value room.\n - Nice view from window, and lets a lot of light in.\n - rarely used toilet right next door.\n - Good kitchen and dining area if you can find space for your perishables.\n - Nice bedder with a room to keep some things in over the holidays.\n - Sink in room.\n - Power showers, makes a big change from top floor rooms in Main College.\n\nCons:\n\n - Smaller than standard rooms in Main College, don't expect to host parties.\n - Not sure how much people who're walking on the road can see inside, especially troublesome coming in from a shower...\n - For 12 people, the kitchen and dining areas are small (only 4 hobs and one oven).\n - Ethernet port is under the bed, on the opposite side of the room from the desk. This requires you to use the WiFi (which has appeared this year) or have a large cable.\n - Only 2 showers between 12, hasn't caused issues after a term and a half but that may be due to very few of us getting up for 9am lectures...\n\nBryn Pickering (bp325) 11/02/2013",
    "floor": 1,
    "name": "Room 8",
    "parentid": "/5AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/C/C17",
    "allocations": {
      "2012": "Benjamin Barna-Laue",
      "2013": "Cameron Holloway",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "A good size for a college standard room. With lockable storage above the wardrobe, a small balcony shared with the next room along on 'D' staircase and a decent shared bathroom. Plenty of light from the garden.",
    "floor": 3,
    "name": "C17",
    "parentid": "/C",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D2",
    "allocations": {
      "2012": "Karndeep Uppal",
      "2013": "Adam Waterson",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Overall, a really nice room - here's why:\n\n - It is one of the biggest rooms in college, which easily  makes up for a the lack of a balcony. \n\n - It has an en-suite bathroom, with an added bonus of a heated towel rail, which some of the slightly older en-suites don't have. \n\n - The desk is in a nice position, nearish the window and below the large notice board. Oh and in front of the radiator, so you can toast your toes while you work!\n\n - The wi-fi signal is brilliant, with a router just opposite the door. However the ethernet port is not that close to the desk, so bring a long cable if you haven't got wi-fi.\n\n - The room has some lovely views of the gardens, but is lucky enough not to be in the direct firing line of the sun. However the room is plenty bright enough.\n\n - The location is also good because it's one of the furthest rooms away from the Bop room - so if you're not a wild party animal you can still get some shut eye.\n\n - Also, despite the fact that this is classed a ground floor room, the slope of the ground outside means that only a giraffe would be able to stand outside and peep through your windows...\n\n - It's also nice and handy for the kitchen, which is just across the corridor.\n\n - Finally it's also worth mentioning that the lockable holiday storage above the wardrobe is reasonably large, although the wardrobe itself might be slightly small if you've got lots of coats etc. You also won't need to bring your own coat hangers, as the wardrobe already has some hotel-style ones built-in.",
    "floor": -1,
    "name": "D2",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-8b",
    "allocations": {
      "2012": "Fellow's Room"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 8b (Fellow's Room)",
    "parentid": "/2AR",
    "rentband": 0,
    "type": "room",
    "weight": -1
  },
  {
    "_id": "/A/A15",
    "allocations": {
      "2012": "Victoria Akinsowon",
      "2013": "Richard Hobbs",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Balcony not shared, just on the end overlooking the garden. Room slightly more spacious than many standards, because of being on the end of the building. There's a door to the fire escape staircase, but this is lockable. Doesn't get much light, though.",
    "floor": 3,
    "name": "A15",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F6",
    "allocations": {
      "2012": "Alvo von Cossel",
      "2013": "Katherine Lehovsky",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Large room on ground floor, probably most convenient room from porter's lodge. Next door to the games room, so you sometimes get odd noises, such as the chinese orchestra rehearsing, or tap dancing persistently banging through your wall.\n\n**Has good quality piano.**\n\nMain disadvantage (or advantage, whatever you want), is that it's ground floor facing onto college, so you get a fair number of passers by making noise, and spying into your room and whatnot. It's not that big of a worry though.",
    "floor": 0,
    "name": "F6",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M12",
    "allocations": {
      "2012": "Becca Lloyd",
      "2013": "Xinming Yu",
      "2014": "Matt Hopgood"
    },
    "bathroomsharing": 2,
    "body": "Typical first year room and with a bit of re-arrangement quite spacious. Great location just over bar and cafe and 2 seconds from restaurant.\n\nEffort and knuckle destroying getting your stuff up and down 3 lots of tight stairs 3 times a year.\n\nBath and shower are dreadful. Shower temp oscillates from Good to scolding to freezing= not pleasant in the mornings. Bath is the alternative but is designed for a Hobit and sandpaper on the bottom of the bath isn't kind on the back.\n\nNo holiday storage which is frustrating.\n\nFor a first year room its perfect since s'all about the location and comforts of a nice bath are rarely considered.\n\nJack (jhc56)",
    "floor": 3,
    "name": "M12",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/K/K6",
    "allocations": {
      "2012": "Amelia Hewitt",
      "2013": "Laura Bampton",
      "2014": "Greg Barbour"
    },
    "bathroomsharing": 1,
    "body": "Normal sized rectangular college room, looks out onto the second level walkway. Only issue is the wardrobe (and overhead space) is smaller than most. K staircase has a lift which is great for moving in and out (although you can now hear it saying 'doors opening'from the room since they 'fixed' the volume on it). There are also only 3 rooms on the floor and 10 in total on the staircase making it fairly quiet.\n\nClose to the cafe/bar/canteen and porters lodge. You can hear the choir/music from the chapel occasionally too. \n\nWifi signal is poor.",
    "floor": 2,
    "name": "K6",
    "parentid": "/K",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F19",
    "allocations": {
      "2012": "Matthew Hopgood",
      "2013": "Amy Wilson",
      "2014": "(fresher)"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 4,
    "name": "F19",
    "parentid": "/F",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/B/B5",
    "allocations": {
      "2012": "Rebecca Harrison",
      "2013": "Ben Peacock",
      "2014": "Amy Wilson"
    },
    "bathroomsharing": 1,
    "body": "Nice room, a good size. Garden facing, with balcony, but not many people walk past so you are not disturbed often. The room gets reasonably good light, despite the large tree outside the window. \nHas overhead locker for holiday storage, with a large wardrobe.",
    "floor": 0,
    "name": "B5",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F16",
    "allocations": {
      "2012": "Rebecca Price",
      "2013": "Elle Mackenzie",
      "2014": "Rogelio Luque-Lora"
    },
    "bathroomsharing": 2,
    "body": "Just a regular sized room, really.\n\nPretty sweet view, the fellows do supervisions and stuff across the hall, but aren't here at night so feel free to have gatherings. Good room.",
    "floor": 3,
    "name": "F16",
    "parentid": "/F",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/M/M6",
    "allocations": {
      "2012": "Harry Brunton",
      "2013": "Marc Winrow",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "M6",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-15",
    "allocations": {
      "2012": "James McKnight",
      "2013": "Liam McDonnell",
      "2014": "George Ramsey"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 15",
    "parentid": "/5AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A8",
    "allocations": {
      "2012": "Josh Hoskins",
      "2013": "Matthew Bayliss",
      "2014": "Matthew Bayliss"
    },
    "bathroomsharing": 1,
    "body": "Nice big room, refurbished over Summer 2012. Two large windows and two balconies (one is a fire exit). Decent bathroom with a shelf, heated towel rack etc. Not a great amount of natural light due to some big trees outside the windows. Slightly awkward layout, in that you can either have the bed sticking out into the middle of the room, or next to the radiator and under the shelves. Good wireless reception as with most rooms in College now. Large wardrobe along with a fair amount of storage.",
    "floor": 1,
    "name": "A8",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H12",
    "allocations": {
      "2012": "Rogelio Luque Lora",
      "2013": "Laurence Cooper",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "H12 is a lovely, spacious room which gets a lot of sunlight. There is also wifi across the whole room. Unfortunately, there is no holiday storage and it can be quite noisy, with noise travelling very well from front court. However, the sound of people’s drunken conversations echoing into your room can prove rather humorous, occasionally. You can also hear the delightful tunes of the choir on the odd evening and the room looks directly across front court into the geography fellow’s office, what more could you want? \n\nLana (ljw62)",
    "floor": 3,
    "name": "H12",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G",
    "body": "G staircase is on Front Court. It has several communal facilities on it which might make it a noisier place to live:\n\n* Garden level - theatre workshop\n* Court level - games room, payphone\n* First floor - teaching rooms A and B, public toilet",
    "name": "Staircase G",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/I",
    "body": "I staircase is on Front Court, above the Auditorium. It does not have a ground floor entrance, so to get to it you have to go up J staircase (with its unusually narrow door), and go across.\n\nI staircase top kitchen has a lockable cupboard for each room, but most of the keys have disappeared, so they cannot be locked.\nThe kitchen is however in a reasonable condition apart from that.\n\nThe room is pretty much the same as most standard plus rooms. Opens onto the second floor walkway overlooking the plodge. Pretty handy in terms of its position in college but be aware noise carries into the courtyard from it, not one to take if you plan on being particularly loud.",
    "name": "Staircase I",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/1AS/1AS-23",
    "allocations": {
      "2012": "Robert Seaton",
      "2013": "Matej Hamas",
      "2014": "Alex Grafton"
    },
    "bathroomsharing": 0,
    "body": "**Pros**\n\nIts big, joint biggest room (as far as I know) in the grad house.\n\nA few of chairs have been 'acquired' and will be left here for next year (housekeeping dependant).\n\nYour own personal sink and little mirror with vanity light in the corner. Perfect for a rough night, morning, mid afternoon...\n\nKitchen with proper oven, hob, microwave, (small) fridge and freezer.\n\nIts located in the scenic gardens.\n\n**Cons**\n\nThe scenic gardens are about 5 minutes away from food.\n\nIf you know your neighbours noise shouldn't be an issue but the soundproofing is far from ideal.\n\nThe light is pretty poor, one small window in the corner is it for natural light. You get a desk light and a lamp however.\n\nSlanty ceiling means the height of the room varies from about 4m to 1m and **will** result in at least one head injury during your stay here. With the kitchen ceilings verging on lethal.",
    "floor": 2,
    "name": "Room 23",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C18",
    "allocations": {
      "2012": "Peter Carey",
      "2013": "Jack Davies",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Nice room, pretty standard size/shape. South facing windows (onto college) so it will probably get pretty hot in summer, but if you open the balcony door it gets to a nice temperature pretty quickly. You also get lots and lots of sun. Doesn't get cold at all, I've barely needed to use my radiator so far this year. The sun does shine across where the desk is for most of the day, which can be quite annoying.\n\nThere's a balcony shared with someone on D staircase. It's round the far side of college from all the amenities (bar, canteen, jcr etc), but that's not a big deal. It is three flights of stairs up, so that can be interesting when arriving/leaving. But you get lots of exercise. Kitchen on the floor above, plenty of lockable cupboards but rather small fridge (standard size in college, but they're pretty small).\n\nNo lockable storage compartment in the room, and the wardrobe is raised up 1-2 feel off the ground so it's a little difficult to reach the top shelves.\n\nI would suggest bringing a extension cable as there's only one plug just by the desk, although there are several round the room. The ethernet port is right by the desk. I normally use the wireless though, which has really good signal in the room and no problems with the connection/speed etc.",
    "floor": 3,
    "name": "C18",
    "parentid": "/C",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D13",
    "allocations": {
      "2012": "Martijn Bokkerink",
      "2013": "Oliver Hart",
      "2014": "Nicholas Jones"
    },
    "bathroomsharing": 1,
    "body": "Decent holiday storage overhead lockers above three wardrobes. Gets good daylight but not too much so it doesn't get too hot in summer. Door makes an annoying scraping sound each time you open and close it.",
    "floor": 2,
    "name": "D13",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B17",
    "allocations": {
      "2012": "Maeve Slattery",
      "2013": "Jack Sibley",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Very nice room, plenty of space to have mates round if you spin the bed around against the wall and move the desk under the window. Lovely views out the window over the gardens. The trek up to the third floor isn't as bad as it first seems, its just a bit of effort when moving in and out with all your bags.",
    "floor": 3,
    "name": "B17",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/J/J1",
    "allocations": {
      "2012": "Oliver Bussell",
      "2013": "Edward Royall",
      "2014": "Oliver Bussell"
    },
    "bathroomsharing": 1,
    "body": "Long shaped room. Holiday storage yes. Blue coloured walls. Kitchen is only a few feet away which is very very convenient ;) Room is located bang on the centre of the college which is a plus... but it can get a little noisy. Fantastic wardrobe space!",
    "floor": 1,
    "name": "J1",
    "parentid": "/J",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J4",
    "allocations": {
      "2012": "Dhaarica Jeyanesan",
      "2013": "Adeolu Akano",
      "2014": "Matthew Kent"
    },
    "bathroomsharing": 1,
    "body": "Nice big room, plenty of holiday storage. No immediate neighbours as surrounded by function rooms/kitchen which is very convenient. Literally the closest room to the porters' lodge. Window looks out over front court, with access to the first floor walkway.\n\n***Chronic problem of a dripping ceiling light during heavy rain.***",
    "floor": 1,
    "name": "J4",
    "parentid": "/J",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E17",
    "allocations": {
      "2012": "William Tremellen",
      "2013": "Leo Cotterell",
      "2014": "Lily Fitzgerald"
    },
    "bathroomsharing": 2,
    "body": "- View onto the trees at the back\n- Small holiday storage\n- 'L' shaped\n- Reasonable daylight on one half of room\n- Not facing sun\n- Other half has little/no daylight",
    "floor": 3,
    "name": "E17",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/L/L1",
    "allocations": {
      "2012": "Hau Mao",
      "2013": "Rebecca Lloyd",
      "2014": "Vipul Thakurdesai"
    },
    "bathroomsharing": 1,
    "body": "Right next to the kitchen. Probably one of the smaller of the Standard plus rooms, but still a pretty decent size.",
    "floor": 1,
    "name": "L1",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E7",
    "allocations": {
      "2012": "Henry Wiles",
      "2013": "Luma Khasati",
      "2014": "Luma Khasati"
    },
    "bathroomsharing": 1,
    "body": "- Daylight: Average\n - Pretty big compared to some other rooms\n - Backs onto walkway\n\nPretty nice room overall (even if the wardrobe is tiny)",
    "floor": 1,
    "name": "E7",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J11",
    "allocations": {
      "2012": "Stephanie French",
      "2013": "Daniyar Ismailov",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Best room in the world! Pretty large for a standard (but weird trapezium shape), has an ajoined balcony that's as large as the room (summer BBQ?). The other doors on the balcony goes to the fellow suite's living room and kitchen, and they usually never come out. So the balcony is all yours. 1 Locker overhead storage space above wardrobe that fits a large suitcase comfortably. Standard kitchen upstairs. Brilliant view to the garden but is on the shady side. Very quiet if the neighbours behave... Oh yeah there is full tiling on the corridor wall that lead to J12! TILES! Need I say more? ;)\n\n----------\n\nThe light is pretty awful. Otherwise a very nice room.",
    "floor": 3,
    "name": "J11",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/M/M14",
    "allocations": {
      "2012": "Jessica Dealey",
      "2013": "Ben Elgar",
      "2014": "Joe Brennnan"
    },
    "bathroomsharing": 2,
    "body": "Plenty of holiday storage in the roof.\n\nNo sink in rooms, toilet in one room and sink/shower in another room.\n\nReally nice view of the gardens with plenty of natural light, shared balcony with M13.\n\nKitchen on the same floor which is convienient.\n\nOn the top floor so not ideal for moving in and out, but that's pretty much the only downside to this room.",
    "floor": 4,
    "name": "M14",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-5",
    "allocations": {
      "2012": "Nathan Grundy",
      "2013": "Matthew Chambers",
      "2014": ""
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 5",
    "parentid": "/4AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/E/E2",
    "allocations": {
      "2012": "Marc Terzikhan",
      "2013": "Jonathan Ellis",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": -1,
    "name": "E2",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/G/G9",
    "allocations": {
      "2012": "Henry St Leger-Davey",
      "2013": "George Baldwin",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Good size room, right opposite the library.\n\nAlthough, no lockable cupboard.",
    "floor": 3,
    "name": "G9",
    "parentid": "/G",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/J/J15",
    "allocations": {
      "2012": "Zhixuan Zhai",
      "2013": "Jacob Dyble",
      "2014": "Harry Edwards"
    },
    "bathroomsharing": 3,
    "body": "The stairs keep you fit but your not too far from anywhere. Occasionally people have parties in j8 till quite late which you can hear. Its has a balcony shared with j14 and you get good views of the garden. Kitchen is on same floor and it has a sky light you can open so its pretty hard to set off the fire alarm by accident.",
    "floor": 4,
    "name": "J15",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F10",
    "allocations": {
      "2012": "Wing Yeung",
      "2013": "Tsutomu James",
      "2014": "Laura Ridley"
    },
    "bathroomsharing": 1,
    "body": "Horrid room, really noisy when people walk back and forth and gossip outside your room.. the radiator rarely works. The organ scholar is constantly playing various instruments in the room below.. very noisy!",
    "floor": 1,
    "name": "F10",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H13",
    "allocations": {
      "2012": "Yasmin Cazorla Bak",
      "2013": "Patrick Frost",
      "2014": "Richard Skipper"
    },
    "bathroomsharing": 2,
    "body": "Medium-sized with balcony (shared with H14) overlooking the garden.",
    "floor": 4,
    "name": "H13",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/K/K8",
    "allocations": {
      "2012": "Alex Carruthers",
      "2013": "Thomas Folley",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "K8",
    "parentid": "/K",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/P/P11",
    "allocations": {
      "2012": "Angela Holloway",
      "2013": "Gyorgy Denes",
      "2014": "Mark McGill"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "P11",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-4",
    "allocations": {
      "2012": "Catherine Mansfield",
      "2013": "Oliver Bussell",
      "2014": "Andrew Burrell"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 4",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C15",
    "allocations": {
      "2012": "Nicole Brimmer",
      "2013": "George Barton",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Decent sized room. No garden view, but high enough to look over the college, into some trees. Very light (nearly South-facing), with a balcony shared with a room on B-staircase. Lapwing occasionally decides to work, though I have only succeeded in using it once so should not be relied upon. Decent sized wardrobe, working and warm radiator, easy access for network socket, nice armchair included.\n\nThe only problem is the lack of overhead storage meaning that you have to take everything home or leave it in the trunk room.",
    "floor": 3,
    "name": "C15",
    "parentid": "/C",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/I/I3",
    "allocations": {
      "2012": "Umar Patel",
      "2013": "Rohan Giblin",
      "2014": "Daisy Zhixuan Zhai"
    },
    "bathroomsharing": 1,
    "body": "Garden facing balcony, but the window let's in a big draft. Even when the window is fully closed on really windy nights, I can sometimes feel the wind when I'm in bed. But a lot of cupboard storage space and right in the centre of college, opposite the porter's lodge and the library. Altogether, a  nice room.",
    "floor": 1,
    "name": "I3",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D20",
    "allocations": {
      "2012": "Ted Lau",
      "2013": "Myran Lynch-Bathgate",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "This is a great room, it is quite large with a very nice garden view, and handy for the kitchen. The main issue is all the stairs, but the shower is also very poor (low pressure, temperature changes).",
    "floor": 4,
    "name": "D20",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G/G1",
    "allocations": {
      "2012": "Alex Biondini",
      "2013": "Zachary Levin",
      "2014": "Karndeep Uppal"
    },
    "bathroomsharing": 1,
    "body": "There is no description for this room, why not consider adding one?",
    "floor": 1,
    "name": "G1",
    "parentid": "/G",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/P/P12",
    "allocations": {
      "2012": "Francesca D'arcy-orga",
      "2013": "Mohammad Goudarzi",
      "2014": "Emma Combes"
    },
    "bathroomsharing": 2,
    "body": "With sweeping views over the University library and the courtyard this is one of the perfect rooms for people who enjoy the sight of bricks. Unfortunately their is no garden view but you can just about see one or two trees in the opposite car park.\n\nThere is no holiday storage at all, which is a bit of a pain.",
    "floor": 3,
    "name": "P12",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C6",
    "allocations": {
      "2012": "Thomas Bemment",
      "2013": "Ethan Raker",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "This room is big for a standard plus and has a nice en suite. Negative point - it is very dark and gets little daylight.\n\nThe room got refitted with a new bathroom (in a sly attempt by College to try and make it seem like a good room despite the utter darkness which prevails all day every day). It's a very nice bathroom though. If you're a heated-towel-rail loving vampire (like me!) then you'll love the room. It's also really big!",
    "floor": 0,
    "name": "C6",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F6A",
    "allocations": {
      "2012": "Samuel\tRuiz",
      "2013": "Fraser Jardine",
      "2014": "Christopher Goodway"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 6a",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/I/I1",
    "allocations": {
      "2012": "Charlotte Franklin",
      "2013": "Arturo Abruzzini",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Very plesant room except for lack of garden-facing balcony.",
    "floor": 1,
    "name": "I1",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L4",
    "allocations": {
      "2012": "Chong Li",
      "2013": "Jess Dealey",
      "2014": "Thomas Folley"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "L4",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-8",
    "allocations": {
      "2012": "Josh Stratford",
      "2013": "Nathan Procter",
      "2014": "Catherine Hodge"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 8",
    "parentid": "/1S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1S/1S-9",
    "allocations": {
      "2012": "Andrew Witty",
      "2013": "Conor O'Malley",
      "2014": "Mohammad Goudarzi"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9",
    "parentid": "/1S",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-11",
    "allocations": {
      "2012": "Fraser Jardine",
      "2013": "Mark Driver",
      "2014": "William Shackleton"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 11",
    "parentid": "/5AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J9",
    "allocations": {
      "2012": "Anthony Wong",
      "2013": "Emma Hildyard",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "The room has a good view over the main court yard, over looking the chapel and Porter's Lodge, and get's good light during most of the day (much better than garden facing rooms) which can make the room really warm. Bathroom facilities are shared. There is no holiday storage.",
    "floor": 3,
    "name": "J9",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/E/E20",
    "allocations": {
      "2012": "Annie Richardson",
      "2013": "Vicky Bates",
      "2014": "Beth Smith"
    },
    "bathroomsharing": 2,
    "body": "- No holiday storage\n- North-facing, so light levels are variable\n- Shared shower sometimes has hot and cold phases\n\nNB There are quite a lot of stairs to walk up and down",
    "floor": 4,
    "name": "E20",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/I/I2",
    "allocations": {
      "2012": "Aviv Boonin",
      "2013": "Charlotte Eaton",
      "2014": "Aviv Boonin"
    },
    "bathroomsharing": 1,
    "body": "Nice and convenient room just next to the kitchen.",
    "floor": 1,
    "name": "I2",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B11",
    "allocations": {
      "2012": "Henryk Brzyski",
      "2013": "Hugh Burton",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "B11",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/S/S1",
    "allocations": {
      "2012": "Ashleigh Morton",
      "2013": "Sereena Ansari",
      "2014": "Valentine Tongo"
    },
    "bathroomsharing": 1,
    "body": "Big 3 doors wardrobe.",
    "floor": 1,
    "name": "S1",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-22",
    "allocations": {
      "2012": "Kai Man Cheung",
      "2013": "Ryutaro Ikeda",
      "2014": "Adam Waterson"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 22",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F13",
    "allocations": {
      "2012": "Daisy Pope",
      "2013": "Ted Lau",
      "2014": "Joss Meakins"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "F13",
    "parentid": "/F",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/H/H8",
    "allocations": {
      "2012": "Sam Hancock",
      "2013": "Bethan MacDonald",
      "2014": "Julius Schmidt"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "H8",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C13",
    "allocations": {
      "2012": "Samuel Cahill",
      "2013": "Christopher Parmee",
      "2014": "Henry Brereton"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "C13",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-1",
    "allocations": {
      "2012": "Frederick Powell",
      "2013": "Thomas Bemment",
      "2014": "Alex Bate"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 1",
    "parentid": "/6AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C3",
    "allocations": {
      "2012": "Jacob Cunningham",
      "2013": "Zoe Silkstone",
      "2014": "Danielle Shipp"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 0,
    "name": "C3",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M1",
    "allocations": {
      "2012": "Adam Tyrcha",
      "2013": "Farhan Hanif",
      "2014": "Peter Carey"
    },
    "bathroomsharing": 1,
    "body": "- Warm\n - Decent Lapwing signal\n - Phone signal dodgy\n\n_______________________\n\nStaying here 2012-2013. Eduroam (we no longer use Lapwing) signal is great, always works and is picked up by all my devices. Phone signal is also great. The room is warm, and very spacious. Also very close to both the bar, restaurant, and plodge, but is still far enough from the bar that it isn't too noisy. Only downside is the lack of proper balcony, but that's what comes with first floor rooms.",
    "floor": 1,
    "name": "M1",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P4",
    "allocations": {
      "2012": "Debora Brobbey",
      "2013": "Shonit Shah",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "P4",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E10",
    "allocations": {
      "2012": "Becca Muller",
      "2013": "Abigail Bevan",
      "2014": "Sian Taylor"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "E10",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F9",
    "allocations": {
      "2012": "Conner Noteboom",
      "2013": "Kendrick To",
      "2014": "Tom Bennett"
    },
    "bathroomsharing": 1,
    "body": "Smaller than many 'Best' rooms and slightly peculiarly shaped, provocative inscription left on the desk presumbably by some rugby lad years ago, found a pair of shorts behind one of the drawers....",
    "floor": 1,
    "name": "F9",
    "parentid": "/F",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/I/I6",
    "allocations": {
      "2012": "Onoufrios Malikkides",
      "2013": "Martijn Bokkerink",
      "2014": "Daniel Voller"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "I6",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M5",
    "allocations": {
      "2012": "Moxi Shah",
      "2013": "Umar Patel",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "M5",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/S/S8",
    "allocations": {
      "2012": "Marina Pulido Garrote",
      "2013": "Christopher Barton",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Bit of an odd room because it's on the corner of college. This means it's quite big for a standard, it's got two balconies (although one is smaller and just goes to the fire exit) and it's a funny shape (corner-like, in fact). It's got a bigger wardrobe than other rooms I've been in, and a big overhead locker on top. The window has a view over the Adam's road gardens. The big window and two balcony doors means you get a lot of light, which is nice.\n\nIt is quiet, which can be a good thing when you are trying to work.",
    "floor": 3,
    "name": "S8",
    "parentid": "/S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-14",
    "allocations": {
      "2012": "Emily Dean",
      "2013": "Lucas Birrell-Gray",
      "2014": "Anahita Talwar"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 14",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/A/A14",
    "allocations": {
      "2012": "Laura Bampton",
      "2013": "Thomas Southern",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "A14",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N14",
    "allocations": {
      "2012": "Christopher Goodway",
      "2013": "James Clark",
      "2014": "Mikey Teal"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "N14",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-12",
    "allocations": {
      "2012": "Jin-Min Yuan",
      "2013": "Alex Roberts",
      "2014": "Simeon Brookes"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 12",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-3",
    "allocations": {
      "2012": "Nicholas Dickinson",
      "2013": "Victoria Akinsowon",
      "2014": "Richard Hobbs"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 3",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A19",
    "allocations": {
      "2012": "Adam Runacres",
      "2013": "Alex McGeever",
      "2014": "Xinming Yu"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 4,
    "name": "A19",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R5",
    "allocations": {
      "2012": "Anahita Talwar",
      "2013": "Arun Kirupakaran",
      "2014": "Panayiotis Ioannou"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "R5",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-13",
    "allocations": {
      "2012": "Peter Lacey",
      "2013": "Adam Runacres",
      "2014": "Evan Herbert"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 13",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/E/E18",
    "allocations": {
      "2012": "Hugh Burton",
      "2013": "Joseph Brennan",
      "2014": "Chris Khoo"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "E18",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/H/H3",
    "allocations": {
      "2012": "Alex Clark",
      "2013": "Moxi Shah",
      "2014": "Francesca D'Arcy-Orga"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "H3",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-10",
    "allocations": {
      "2012": "Lara Tembey",
      "2013": "Henryk Brzyski",
      "2014": "Miriam Shaul"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 10",
    "parentid": "/2AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-13",
    "allocations": {
      "2012": "Judith Fagelson",
      "2013": "Nicholas Smith",
      "2014": "Yong Tan"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 13",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C11",
    "allocations": {
      "2012": "Tom Bennett",
      "2013": "Henrietta Hill",
      "2014": "Sam Brooks"
    },
    "bathroomsharing": 1,
    "body": "Fairly standard, everything works, room layouts not brilliant - there'll be better rooms knocking around but this one isn't bad at all.",
    "floor": 2,
    "name": "C11",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/K/K7",
    "allocations": {
      "2012": "Richard Slade",
      "2013": "Jay Parekh",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Relatively quiet with good garden view. Facilities in working order. Close to college amenities, useful lift. Some ladybird issues. Suffers the usual common faults of College rooms.\n\nStaircase Facilities\n-------------------------\n\nExcessively leisurely lift invaluable for moving in and out. Spatially proximate to bar. Kitchen on floor above is small - the door does not open fully. It contains a combi-wave and normal microwave - both in working order, capacious cupboard-space. Fridge with a tiny freezer shelf. Two electric hobs.\n\nConstruction\n----------------\n6 walls. Dual windows open and close, inadequate sealing, with a panoramic view of the College Garden. Fire escape, or what could generously be described as a balcony, connects to adjacent room on L staircase. Shares other wall with a K staircase flat.\n\nDoor is sub-par: poor fitting gives an uneven top and bottom edge; small gash on exterior of door artisanly repaired with sticky-back plastic; interior 'Please Lock Me' label well-worn; no clothes hook. The door's general design is flawed in that there is a 5cm chasm between the floor and the bottom of the door that prevents the use of a standard door wedge and accommodates a substantial burst of light should the hall light be left on at night - though this can be corrected by judicious placing of the bed.\n\nCarpet is to good approximation horizontal, contains one cm-sized lump of solder (included).\n\nWall paint condition: generally good, one or two chips, very few scuffs; broadly even application.\n\nNoise\n-------\n\nNoise: Quieter than average most of the time.\n\nFloor creakiness: About average.\n\nAdjacent (anisotropic weighting) room floor creakiness: Quieter than average.\n\nBathroom Facilities\n-------------------------\nSuffer from drawbacks common to all College rooms: binary shower temperature; bathroom mirror fitted defiantly on wall perpendicular to and away from sink; and the underpowered flush mechanism leaves something to be desired. The bathroom now has a miniature plastic bin. Sink and shower drain well.\n\nFurniture and Fittings\n----------------------------\nStandard.\n\nMirror is missing top right screw cap, otherwise reflects well.\n\nPower: there are four standard plug sockets, 2 near the desk and 2 on the opposite side of the room near your bed - last PAT in 2002. Radiator provides sufficient heating.\n\n5 standard depth non-equidistant shelves. Two solid chairs, ample back support. Modern kettle, with holster, and a below average volume of limescale. Solid desk.\n\nThe bed is of sturdy construction and comfort; it is a relatively quiet bed.\n\nHanging rail lacks metal clips to secure hangars and directly above bed, so of limited use.\n\nThe noticeboard is in good condition and has a structural surplus of 6 drawing pins.\n\nWardrobe locking magnets are somewhat overpowered. Depthwise hanging could be more generous.\n\nVacation Storage\n-----------------------\nContains standard vacation storage in overhead locker. However, this also suffers from a fundamental design flaw: its vertical hinging means that to operate you must either risk breaking your possessions, have a school window opening pole, or risk loss of conciousness. Having a horizontal hinging system would also prevent a padlock with an unfortunate moment of inertia annoying conference guests every time they open the wardrobe.\n\nLighting\n----------\nWest-facing so no overheating. Natural desk light is OK. Main light is very dim. Desk lights are energy-saving and bright.",
    "floor": 3,
    "name": "K7",
    "parentid": "/K",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/flats/F5B",
    "allocations": {
      "2012": "Zyad Wright",
      "2013": "Benjamin Hancock",
      "2014": "Alasdair Pollock"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 5b",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/L/L6",
    "allocations": {
      "2012": "Megan Kennedy",
      "2013": "Eleanor Brodie",
      "2014": "Hannah Day"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "L6",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A18",
    "allocations": {
      "2012": "Douglas Robinson",
      "2013": "Michael Teal",
      "2014": "Harry Kalms"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 4,
    "name": "A18",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/E/E5",
    "allocations": {
      "2012": "Katie Honey",
      "2013": "Jonathan Yip",
      "2014": "Tom James"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 0,
    "name": "E5",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H11",
    "allocations": {
      "2012": "Ben Peacock",
      "2013": "Andrew Burrell",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Nice view of the garden and has a small shared balcony. The radiator is behind the desk (which you can't move because of the position of the internet connection plug), which isn't good for heating the room or drying clothes, but it still stays relatively warm.",
    "floor": 3,
    "name": "H11",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D14",
    "allocations": {
      "2012": "Lucy Cooke",
      "2013": "Jessica Radley",
      "2014": "Sam Allen"
    },
    "bathroomsharing": 1,
    "body": "D14 is a good sized room with a nice layout. It gets plenty of sunlight which means the room is always warm but this can be a bit of a pain as you have to shut the curtains when working to keep the sun off your computer screen. Hanging space is a bit limited but there is still enough and there is vacation storage space. Shares a balcony with E11 though the view from the balcony is rubbish unless you like looking out onto a roof. I kept this same room from last year and would say its good points make the flaws bearable.",
    "floor": 2,
    "name": "D14",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F6C",
    "allocations": {
      "2012": "Florence Gracey",
      "2013": "Steven Gordon",
      "2014": "Richard Odle"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 6c",
    "parentid": "/flats",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D4",
    "allocations": {
      "2012": "Daniel Rosen",
      "2013": "Benjamin Breheny",
      "2014": "William Fitzalan Howard"
    },
    "bathroomsharing": 1,
    "body": "Pretty standard for a standard plus room.  \n\n - Nice size\n - Nice View\n - Bit dark\n - Good triple wardrobe\n - Big Desk",
    "floor": 0,
    "name": "D4",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B15",
    "allocations": {
      "2012": "Thomas Arneil",
      "2013": "Helen Briggs",
      "2014": "Laurence Cooper"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "B15",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F1",
    "allocations": {
      "2012": "Marie How Choon",
      "2013": "Marie How Choon",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Nice room, no natural light, really noisy cause people are always in and out of the kitchen, lots of spiders from being next to the gardens.. it's CRAP!!!!",
    "floor": -1,
    "name": "F1",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L8",
    "allocations": {
      "2012": "Valentine Tongo",
      "2013": "Jamie Macnab",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "L8",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "name": "Room 8 (Fellow's/Graduate)",
    "parentid": "/1AS",
    "type": "room",
    "bathroomsharing": 0,
    "rentband": 0,
    "floor": 0,
    "_id": "/1AS/1AS-8",
    "body": "",
    "allocations": {}
  },
  {
    "name": "A7 (Fellow's Room)",
    "parentid": "/A",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 1,
    "_id": "/A/A7",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/A/A10",
    "allocations": {
      "2012": "Faruq Quadir",
      "2013": "Faruq Quadir",
      "2014": "Faruq Quadir"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "A10",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C20",
    "allocations": {
      "2013": "Unavailable",
      "2014": "(fellow)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 4,
    "name": "C20",
    "parentid": "/C",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/S/S4",
    "allocations": {
      "2012": "Daniella Allard",
      "2013": "Marc Terzikhan",
      "2014": "Yojan Patel"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "S4",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-12",
    "allocations": {
      "2012": "Louis Tam",
      "2013": "Louis Tam",
      "2014": "Stephanie Brown"
    },
    "bathroomsharing": 0,
    "body": "It's a nice room. If you leave the window open, bits of the tree come in. This also sometimes happens in room 11.",
    "floor": 2,
    "name": "Room 12",
    "parentid": "/1S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F14",
    "allocations": {
      "2012": "Matthew Seymour",
      "2013": "Matthew Seymour",
      "2014": "Edward Cruz Cervera"
    },
    "bathroomsharing": 1,
    "body": "This is a good sized ensuite room. It has a fair amount of holiday storage and a wardrobe. The room is very quiet, since it is on the opposite side of the college to the bar etc. It has a bit of a dismal view (of a roof) but the wondows open out onto the end of the second floor walkway, so people don't ever really walk past.\n\nThe network connection is right behind the desk.",
    "floor": 2,
    "name": "F14",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J10",
    "allocations": {
      "2012": "Jessie Zhang",
      "2013": "Fiona Johnson",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "I got very fond of this room but it is absolutely tiny - it's smaller than a Value room but you are forced to pay for a Standard room. (Unless, like me, you refuse to pay and persuade the bursar to give you a discount).\n\nVarious problems include:\n- lack of space, meaning that there is no room for a bedside table\n\n- the wall between this room and the flat next door is only one sheet of hardboard, and you can therefore hear everything said next door.\n\n- the bathroom isn't split between shower/toilet\n\n- there's a lack of plug sockets\n\n- it's right above the J8 function room, so that can get a bit noisy\n\nOther than that, it's right across the court from the plodge and it does provide an air of cosiness!",
    "floor": 3,
    "name": "J10",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/E/E1",
    "allocations": {
      "2012": "Charlotte Hensman",
      "2013": "Rebecca Lee",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": -1,
    "name": "E1",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A2",
    "allocations": {
      "2012": "Benjamin Breheny",
      "2013": "Sahil Shah",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": -1,
    "name": "A2",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E8",
    "allocations": {
      "2012": "Rupert Price",
      "2013": "Bryony Watson",
      "2014": "Samuel Carr"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "E8",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/I/I8",
    "allocations": {
      "2012": "David Rattigan",
      "2013": "Wing Yeung",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "I8",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-5",
    "allocations": {
      "2012": "Nicholas Smith",
      "2013": "Julija Stukalina",
      "2014": "Ollie Hart"
    },
    "bathroomsharing": 0,
    "body": "Huge Room, lots of floorspace. Next to kitchen. 2 bathrooms and a toilet shared between 3 rooms on this floor, so there is always one free.",
    "floor": 0,
    "name": "Room 5",
    "parentid": "/6AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E14",
    "allocations": {
      "2012": "Rebecca Oldham",
      "2013": "Kuo Chan",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "E14",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/I/I13",
    "allocations": {
      "2012": "Jocelyn Meakins",
      "2013": "Simeon Brooks",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "I13",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/N/N12",
    "allocations": {
      "2012": "Tom Latimer",
      "2013": "James Disley",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "N12",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-1-6",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Rooms 1-6 (Fellow's Rooms)",
    "parentid": "/2AR",
    "rentband": 0,
    "type": "room",
    "weight": -1
  },
  {
    "_id": "/N/N5",
    "allocations": {
      "2012": "Jian Poh",
      "2013": "Alex Short",
      "2014": "Alex Short"
    },
    "bathroomsharing": 1,
    "body": "Pretty big room; I don't think I've been in another Standard Plus room that's any bigger, with lots of wall space for your posters, etc. The bathroom is also reasonably spacious. Everything seems to be logically placed, such as the ethernet port being next to the desk and so on. I've never been able to get a decent wifi signal really, though I haven't spent that much time trying - there may be certain areas of the room where you can get signal since it is so close to the cafe. Walk down two flights of stairs and you're outside the bar, and the fact that it is two floors down means that you don't get much of the noise from it either. It also has a medium sized lockable cupboard above the wardrobe for vacation storage which as I found last vacation, is larger than you think, I only describe it as medium because I've seen larger ones in some rooms.\n\nI guess the only downside is the fact that it doesn't really have a balcony, as it backs out onto the walkway around college, but some people may prefer that.\n\nGet it if you want a large room that is conveniently located very close to the bar, cafe, canteen, hall - basically the main \"social hotspots\" of college.\nDon't get it if you would prefer a quieter location, as this is what I would describe as the busier side of college.",
    "floor": 2,
    "name": "N5",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-11",
    "allocations": {
      "2012": "Roman Pronin",
      "2013": "Richard Allitt",
      "2014": "Matthew Cottell"
    },
    "bathroomsharing": 0,
    "body": "Good\n----\n+ Pretty large room\n+ Two desks\n+ Sink in the room\n+ Bath/shower directly opposite\n+ Two toilets on this floor\n+ Kitchen directly opposite\n\nBad\n---\n- Rather expensive for what it is\n- No lockable storage\n- Cold in winter, even with both radiators on\n- Rather noisy from the kitchen\n- Not much fridge/freezer space\n- Desks by the window, too much direct sunlight\n- Not much natural light in the rest of the room (lights on most of the time)\n- Whole house feels a bit old/run-down (furniture a bit aged, walls in need of repainting)",
    "floor": 1,
    "name": "Room 11",
    "parentid": "/6AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/S/S9",
    "allocations": {
      "2012": "Aislinn McDonagh",
      "2013": "Philippa Carr",
      "2014": "James Pinder"
    },
    "bathroomsharing": 1,
    "body": "The room has its own (not shared) balcony on college side as it is at the end of college. It has no lockable cupboard, and the door rattles when it is windy.\n\nThe kitchen above is normally quiet as the staricase is the smallest in college.",
    "floor": 3,
    "name": "S9",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-15",
    "allocations": {
      "2012": "Anna Williamson",
      "2013": "Katherine O'Neill",
      "2014": "Emma Gerrard"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 15",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/flats/F5C",
    "allocations": {
      "2012": "Joshua Levy",
      "2013": "James Sandow",
      "2014": "Freddie Ashford"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 5c",
    "parentid": "/flats",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P14",
    "allocations": {
      "2012": "Benjamin Hancock",
      "2013": "Alexander Himsworth",
      "2014": "Maeve Slattery"
    },
    "bathroomsharing": 2,
    "body": "Balcony shared with P13.\n\nPros :\n\n- Good view\n- Kitchen on same floor\n- Quiet and peaceful and out of the way\n- Close to bar, canteen and side exit door to path to river\n\nCons :\n\n- Top floor so lots of climbing to do\n- Small Size\n- No vacation storage\n\nOther notes : Late afternoon sun, can be in eyes at times and room isnt warmed up/illuminated by sun as much as I'd like.",
    "floor": 4,
    "name": "P14",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/Q/Q1",
    "allocations": {
      "2013": "Unavailable",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "Q1 (accessible room for disability)",
    "parentid": "/Q",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-6",
    "allocations": {
      "2012": "Stoyan Stoyanov",
      "2013": "Ellie Riches",
      "2014": "Ben Elgar"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 6",
    "parentid": "/6AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F3B",
    "allocations": {
      "2012": "Camilla Rooney",
      "2013": "Julian Mack",
      "2014": "Shonit Shah"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 3b",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/K/K5",
    "allocations": {
      "2012": "Justine Shek",
      "2013": "Anahita Talwar",
      "2014": "Alex McGeever"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "K5",
    "parentid": "/K",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A1",
    "allocations": {
      "2012": "Nicholas Tomlinson",
      "2013": "Avish Patel",
      "2014": "(fresher)",
      "undefined": null
    },
    "bathroomsharing": 1,
    "body": "Basement room at the end of college. The room can be a little dark/cold due to the tree outside the window.",
    "floor": -1,
    "name": "A1",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E19",
    "allocations": {
      "2012": "Heather Keenan",
      "2013": "Maeve Slattery",
      "2014": "Beth Oakley"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "E19",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/I/I5",
    "allocations": {
      "2012": "Thomas Weir",
      "2013": "Thomas Baines",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "I5",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N4",
    "allocations": {
      "2012": "Piya Haria",
      "2013": "Sambavi Sritharan",
      "2014": "Tom Baines"
    },
    "bathroomsharing": 1,
    "body": "Total lack of sunlight, horrible court facing view. Skanky bath. But generally alright.",
    "floor": 1,
    "name": "N4",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-8a",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 8a (Fellow's Room)",
    "parentid": "/2AR",
    "rentband": 0,
    "type": "room",
    "weight": -1
  },
  {
    "_id": "/L/L3",
    "allocations": {
      "2012": "Dominic Murray-Vaughn",
      "2013": "Alexander Clark",
      "2014": "Lucia Coulter"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "L3",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O5",
    "allocations": {
      "2012": "Timothy Headley",
      "2013": "Henrik Wetter-Sanchez",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "O5",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "name": "A3 (Fellow's Room)",
    "parentid": "/A",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 0,
    "_id": "/A/A3",
    "body": "",
    "allocations": {}
  },
  {
    "name": "K1 (Fellow's Guest Room)",
    "parentid": "/K",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 1,
    "_id": "/K/K1",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/R/R13",
    "allocations": {
      "2012": "Chieh Ng",
      "2013": "Charlotte Rogers",
      "2014": "Jack Davies"
    },
    "bathroomsharing": 3,
    "body": "Sure, you have to climb a lot of stairs to get to it, and sure, you have to share a bathroom with two other people and granted, there's no place to put your stuff over the holidays and O.K. its a mite smaller than the non-value rooms, but appart from all that R13 is one of the finest rooms in college.\n\nCurrently around £600 less per year than a standard room, R13 is almost as big as a standard and far bigger than many of the value rooms in the houses. It also has an interesting view onto high court where, if you're lucky, of a morning you can see the dupty warden exiting his personal chambers for a stroll. On top of this, there's more than enough light in the room to keep you from getting seasonal affective disorder (SAD).\n\nIt also has roof access, which you're not allowed to use, of course, but if you did would possibly provide a sterling view onto the vista of central cambridge, including the tips of Kings college chapel, the law faculty, the UL and burrels walk. Oh, R13, how could I ask for anything more?",
    "floor": 4,
    "name": "R13",
    "parentid": "/R",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/B/B7",
    "allocations": {
      "2012": "Christopher Parmee",
      "2013": "Tom Bennett",
      "2014": "Ho Zheng Han"
    },
    "bathroomsharing": 1,
    "body": "A lovely little number. A pretty spacious ensuite, and although forward facing you actually get a view of some trees and a bit of Herschel Road. It's up at a quiet end of college too, which may be worth considering, although it is slightly further away from the bar (but if you really wanted a pint you'd run). Overhead storage space above wardrobe and a fantastic new kettle with billions of exciting features such as boil, evaporate and bubble. Although it's on a walkway, it's relatively quiet as the only people that walk past are those going to A staircase (or occassionally a lone maintenance man with a spanner).",
    "floor": 1,
    "name": "B7",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D11",
    "allocations": {
      "2012": "Adeolu Akano",
      "2013": "Becca Muller",
      "2014": "Will Yeeles"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "D11",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F3A",
    "allocations": {
      "2012": "Katerina Pascoulis",
      "2013": "Matthew Thomas",
      "2014": "Steven Gordon"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 3a",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/K/K9",
    "allocations": {
      "2012": "Yojan Patel",
      "2013": "Richard Skipper",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Has an excellent name",
    "floor": 4,
    "name": "K9",
    "parentid": "/K",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/N/N10",
    "allocations": {
      "2012": "Artue Reszka",
      "2013": "Aislinn McDonagh",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "N10",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/B/B18",
    "allocations": {
      "2012": "Victoria\tBates",
      "2013": "Zheng Ho",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Faces the rugby pitch, reasonable daylight, no sink. Narrow balcony shared with next-door. Pretty unremarkable room generally.",
    "floor": 3,
    "name": "B18",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F15",
    "allocations": {
      "2012": "Alexandra Roberts",
      "2013": "Sian Cotton",
      "2014": "Luke Main"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "F15",
    "parentid": "/F",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/H/H5",
    "allocations": {
      "2012": "Alexander Bentley",
      "2013": "Karndeep Uppal",
      "2014": "Charlotte Eaton"
    },
    "bathroomsharing": 1,
    "body": "Average Standard Plus Room, close to the library and plodge. No direct connection to the ground level (Auditorium) - bit annoying.\nBathtub looks quite old... otherwise a decent room.",
    "floor": 2,
    "name": "H5",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L12",
    "allocations": {
      "2012": "Bryn Coldwell",
      "2013": "Richard Slade",
      "2014": "Abigail Harris"
    },
    "bathroomsharing": 2,
    "body": "Balcony Shared with M10 but off walkway so noone walks past\nBalcony overlooks the smoking area which means it can be quite loud but also useful to work out who is around college.\nNo holiday storage",
    "floor": 3,
    "name": "L12",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/Q/Q9",
    "allocations": {
      "2012": "Emma Gerrard",
      "2013": "Debora Brobbey",
      "2014": "Yan Pvi Ko"
    },
    "bathroomsharing": 1,
    "body": "Refurbished but small standard plus.",
    "floor": 3,
    "name": "Q9",
    "parentid": "/Q",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C9",
    "allocations": {
      "2012": "Michael Dinan",
      "2013": "Daisy Zhixuan Zhai",
      "2014": "Jiaying Yan"
    },
    "bathroomsharing": 1,
    "body": "Standard Ensuite college room with the usual features. The walls have been painted a mild yellow which helps brighten up the room. Being a garden facing room on Herschel court, you get little sunlight, but this comes in handy during easter term when the other rooms get quite hot. Everything in's pretty good condition (a few scratches on the windows might annoy a few people though) and the mattress has been replaced. Keep in mind it's a two floor trip to the nearest kitchen (although during Michaelmas/Lent putting things by the window keeps some stuff chilled).\n\nBeing a bit away from the centre of college, it's a little quieter but you still get the usual noise from bops, other rooms, creaky floorboards etc...",
    "floor": 1,
    "name": "C9",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B8",
    "allocations": {
      "2012": "Konstantin Roder",
      "2013": "Macks Bougeard",
      "2014": "Jay Parekh"
    },
    "bathroomsharing": 1,
    "body": "B8 is a pretty awesome room. Hallway with a double wardrobe and storage space for the holidays, and a bit bigger in all than most Standard Plus rooms. It's really quiet, although there are a few pianists nearby. It gets a bit dingy in the winter, but you can sleep without morning sun coming into the room. Shares the long balcony with all of the court's staircases. You're going to have to walk two staircases to get to a kitchen, but that's definitely better than being on the top floor.\n\nasd x",
    "floor": 1,
    "name": "B8",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H9",
    "allocations": {
      "2012": "Samuel Kaplan",
      "2013": "Emma Combes",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Fairly spacious room because its quite square. Gets lots of sunlight in the morning; wakes you up in time for lectures; annoying if you want a lie in. Has a nice little balcony with a great view of the front court although people can see in to your room from some of the teaching rooms opposite.\n\nGets a lot noise from front court after formals/cindies nights etc and for some reason the sound of people walking/running across the walkway on the floor below resonates quite loudly into the room. The cupboard is also a little small and high up and there is no holiday storage. Another thing is that quite a lot of spiders make their way into the room during winter and there is always a spider web across the balcony door meaning you get a faceful of spiderweb everytime you step outside.\n\nAll in all a nicely laid out room with lots a light but also gets a lot of noise.",
    "floor": 3,
    "name": "H9",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/L/L14",
    "allocations": {
      "2012": "Harry Orchard",
      "2013": "Vipul Thakurdesai",
      "2014": "Yasmin Cazorla-Bak"
    },
    "bathroomsharing": 2,
    "body": "There's a huge draft from the door- you can mitigate it mostly by leaning a heavy book against it.\nWhat's kinda annoying is that there's only one plug socket near the desk (unlike L13)-- you can either have light or have your laptop on charge, not both :(",
    "floor": 4,
    "name": "L14",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "name": "F2 (Fellow's Room)",
    "parentid": "/F",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": -1,
    "_id": "/F/F2",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/D/D1",
    "allocations": {
      "2012": "Michael Panayi",
      "2013": "Martin Weston",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Spacious room. Next door to the kitchen but the kitchen door makes a loud clicking noise when closed. Large wardrobe with a large storage cupboard above. In basement from Herschel Court but a few steps up from ground level from the garden side. A bit low on natural light. Can get cold in cold weather due to the draught from the outside door down the corridor but this can be solved by closing the room's inside door. Network socket and desk on opposite wall to the pin board.Two double electrical sockets (one next to desk and network socket) and a single one near the bed. No shelf in the bathroom. Nice view of the trees and the squirrels can come pretty close to the window too.",
    "floor": -1,
    "name": "D1",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A5",
    "allocations": {
      "2012": "Henry Tozer",
      "2013": "Henry Tozer",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 0,
    "name": "A5",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B19",
    "allocations": {
      "2012": "Jonathon Spencer",
      "2013": "Luke Main",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 4,
    "name": "B19",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-9",
    "allocations": {
      "2012": "Samuel Pattuzzi",
      "2013": "Christopher Silvester",
      "2014": "Farhan Hanif"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9",
    "parentid": "/5AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B16",
    "allocations": {
      "2012": "Guy Smith",
      "2013": "Tilly Roberts",
      "2014": "Henry St Leger-Davey"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "B16",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A11a",
    "allocations": {
      "2012": "Jimmy Cambell",
      "2013": "Sam Brooks",
      "2014": "Robbie Jones"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "A11a",
    "parentid": "/A",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/C/C8",
    "allocations": {
      "2012": "Timothy Stoten",
      "2013": "Will Tremellen",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "C8",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H10",
    "allocations": {
      "2012": "Yong Tan",
      "2013": "Georgina Edmonds",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "This room is great. It is a really good size and shape, so you can move your furniture around heaps of times.\n\nIt is on the third floor, which means a fair few steps to climb when you're bringing your luggage up. But it is manageable, and fortunately not at the very, very top. And the extremely useful storage space it has above the wardrobe definitely makes up for the stairs!\n\nIt is also such a conveniently placed room college-wise - in the middle of centre court and opposite the library. You will also have a shared balcony with a lovely view and space to chill.\n\nDefinitely one of the best standard rooms in college.",
    "floor": 3,
    "name": "H10",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-1",
    "allocations": {
      "2012": "Katherine Soper",
      "2013": "Catherine Hodge",
      "2014": "Ben Gates"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 1",
    "parentid": "/5AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L2",
    "allocations": {
      "2012": "Callum McCutcheon",
      "2013": "Matthew Kent",
      "2014": "Aislinn McDonagh"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "L2",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-13",
    "allocations": {
      "2012": "Charles Holland",
      "2013": "Charles Holland",
      "2014": "Henry Wiles"
    },
    "bathroomsharing": 0,
    "body": "Good skylight.",
    "floor": 2,
    "name": "Room 13",
    "parentid": "/1S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O10",
    "allocations": {
      "2012": "Arthur Henderson",
      "2013": "Robert Law",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Decent sized room, if you put the desk under the window and the bed against the wall it increases the amount of floor space you have dramatically.\n\nLovely view but the windows can let the cold in if the wind is coming from the wrong direction.\n\nIn the evenings it can get a little dark as there aren't really enough lights.",
    "floor": 3,
    "name": "O10",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/S/S7",
    "allocations": {
      "2012": "Ifeyinwa Frederick",
      "2013": "Oliver Garner",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Normal sized room, no overhead locker :-( Reasonable amount of light. Balcony is shared with an office so, really, it's all yours.",
    "floor": 3,
    "name": "S7",
    "parentid": "/S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1S/1S-10",
    "allocations": {
      "2012": "Gianpiero Roscelli",
      "2013": "Gianpiero Roscelli",
      "2014": "Arthur Henderson"
    },
    "bathroomsharing": 0,
    "body": "Bad points: North-facing, so gets no direct sunlight. Can feel small if you do something daft like put the wardrobe in front of the window (how it was when I found it).\nGood points: You can rearrange the room to make it look massive, if you bring power-extension-cables, but there isn't much spare space. You don't have to go upstairs/downstairs to get to the bathroom. The squirrels in the tree opposite are also a good source of procrastination. There's not too much noise from elsewhere in the house (kitchen & hall). The ceiling has not fallen in yet.",
    "floor": 1,
    "name": "Room 10",
    "parentid": "/1S",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/P/P13",
    "allocations": {
      "2012": "David Sparkhall",
      "2013": "Jonny Spencer",
      "2014": "Vicky Bates"
    },
    "bathroomsharing": 2,
    "body": "Nice room, on the smaller side but makes up for it in being on the same floor as the kitchen, little noise, great view of the gardens. 3 door-wardrobe although no holiday storage space",
    "floor": 4,
    "name": "P13",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-1",
    "allocations": {
      "2012": "Catherine Hodge",
      "2013": "Yong Tan",
      "2014": "Alex Berry"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 1",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/sets/S27A",
    "allocations": {
      "2012": "James Alexander",
      "2013": "Jennifer Honeywood",
      "2014": "Ross Mackie"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "Set 27a",
    "parentid": "/sets",
    "rentband": 1,
    "type": "room"
  },
  {
    "name": "C19 (Fellow's Room)",
    "parentid": "/C",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 4,
    "_id": "/C/C19",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/2AR/2AR-9",
    "allocations": {
      "2012": "Fellow's Room"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9 (Fellow's Room)",
    "parentid": "/2AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-7",
    "allocations": {
      "2012": "Jacob Waller",
      "2013": "Catherine Mansfield",
      "2014": "Max Baxter-Allen"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 7",
    "parentid": "/5AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/M/M3",
    "allocations": {
      "2012": "Abigail Li",
      "2013": "Mike Antony",
      "2014": "Adam Tyrcha"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "M3",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-4-5",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Rooms 4 & 5 (Fellow's Rooms)",
    "parentid": "/5AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/G/G4",
    "allocations": {
      "2012": "Emily Hunka",
      "2013": "Andrew Shipley",
      "2014": "Chi Leung"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "G4",
    "parentid": "/G",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/A",
    "body": "A staircase is on Herschel Court.\nKitchens in the Basement and on the 4th Floor.",
    "name": "Staircase A",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/flats",
    "body": "Flats are designed for 3 people. They consist of 3 bedrooms and a bathroom on ground level, and downstairs there is a living area and kitchen for the flat. Again, if you wish to choose a flat, all three people must be together in the room ballot. Flats tend to be taken very early on in the ballot, so be realistic about your chances of getting a flat.\n\n//Use the syntax -allocation:roomID- to automatically insert\n//allocation text.\n//-allocation-current:roomid- and -allocation-next:roomid- \n//are also available.\nFlat 3\n------\nHerschel Court, opposite D Staircase\n\n - [A - Best, [allocation:F3A]](#/flats/F3A/)\n - [B - Best, [allocation:F3B]](#/flats/F3B/)\n - [C - Standard Plus, [allocation:F3C]](#/flats/F3C/)\n\nFlat 5\n------\nHerschel Court, opposite F Staircase\n\n - [A - Best, [allocation:F5A]](#/flats/F5A/)\n - [B - Best, [allocation:F5B]](#/flats/F5B/)\n - [C - Standard Plus, [allocation:F5C]](#/flats/F5C/)\n\nFlat 6\n------\nHerschel Court, opposite F Staircase\n\n - [A - Best, [allocation:F6A]](#/flats/F6A/)\n - [B - Best, [allocation:F6B]](#/flats/F6B/)\n - [C - Standard Plus, [allocation:F6C]](#/flats/F6C/)",
    "name": "Flats",
    "parentid": "Root",
    "type": "page",
    "weight": 2
  },
  {
    "_id": "/6AR",
    "body": "There is no description for this house, why not consider adding one?",
    "name": "6 Adams",
    "parentid": "Root",
    "type": "staircase",
    "weight": 4
  },
  {
    "_id": "/firstYears",
    "body": "What to do:\n\n1. Decide who, if anyone, you would like to ballot with.  Write your name(s) on a piece of paper fold it up and put it in the appropriate box in the Plodge by 1pm Saturday 16th Feb. **Note that it is important to ballot even if you are not balloting in a group. Failure to ballot results in you being at the very bottom of the choosing order and you may not get a room that suits you.**\n\n2. If you want to, come to the JCR for the draw at 7pm on Sunday 17th Feb.  The order of the draw will be the order in which you choose your rooms. **You do not have to choose rooms in the exact same place as those you balloted with, you just choose the room you’re getting at the same time as them.**  This order gets reversed for choosing in your second year.  Don’t worry if you cannot make the actual draw, although most people usually like to be there - the results along with the times you are expected to choose at will be posted the next day in the JCR.\n\n3. Check the ballot list in the JCR - note the time for choosing allocated to you. Look at the college plans on the JCR notice boards and get an idea of what room you would like to pick.\n\n4. Turn up to choose your room on Wednesday 27th February.  Please arrive at least 5 minutes before the time printed on the lists in the JCR to see which rooms are still available.\n\nGroups\n------\n\nBalloting in a group ensures that you all get to choose at a similar point in the ballot - so you can choose a room near your friends.  Groups must be limited to a maximum of 5. If you want to ballot in a group, put all the names on one piece of paper and **ensure that every member of the group has signed it before** placing it in the ballot box. You will be placed in the order that your names appear on the piece of paper.\n\nYou may also wish to come and see some of the 2nd year choosing at 7pm on Monday 25th Feb to get an idea of how everything works.\n\nSets and Flats\n--------------\n\nAll individuals who wish to choose a set or flat must ballot together, i.e. sets or flats can only be filled by people who are directly next to each other in the ballot. This means that an individual cannot choose one room in a flat or set and then hold it for other individuals further down the ballot. \n\nRound 2\n-------\n\nThe second round is designed to allow individuals to fill any unfilled flats and sets that were not filled by groups in the first round.  It also allows people to swap into fresher rooms. However, there must be a convincing reason for that change and the fresher room must be the same price or more expensive, so as to prevent the fresher pool becoming too expensive.  All swaps are at the Vice President’s discretion.\n\nWhat Rooms Are Available?\n-------------------------\n\nWithin the main college building there approximately 300 rooms, ranging in price, en suite/shared, view etc. This also includes a small number of sets (house two) and flats (house three). These sets and flats, however, often go early on in the ballot.\n\nThe college owns houses on Adams Road and Sylvester Road; approximately 80 rooms will be available to undergraduates.\n\nPlans, full room lists, predicted rents and facilities information will be available on the notice boards in the JCR from Saturday 9th Feb.\n\nLiving Out\n----------\n\nNobody has to live out of college accommodation, but you may do so if you wish. However, you will not receive a living out allowance as the choice is voluntary. If you decide to live out, you should contact the University Accommodation Service at Kellet Lodge, Tennis Court Road, or visit http://www.accommodation.cam.ac.uk/, who should be able to help you find appropriate accommodation. If you are going to live out, inform me and do not enter the room ballot.  If you are considering living out, please note:\n\n- Those who opt to live out at the ballot stage cannot opt back in and expect to be accommodated.  Only after the freshers have been allocated rooms in the first week in September will it be clear whether there are rooms available.\n\n- If a student takes part in the ballot and subsequently opts to live out, he or she will have permanently deprived him/herself of the room allocated; if he or she subsequently opts back in, the room allocation is likely to take place at the earliest only after the freshers have been allocated rooms in the first week in September.\n\n- A student who opts to live out prior to the end of Easter Term (for 12/13 this is Friday 14 June 2013) will have no obligation for Residence Charge in the Michaelmas term, even if his or her decision results in a room being left empty.\n\n- A student who opts to live out after the end of Easter Term will be required to pay a term’s Residence Charge for the room he or she had been allocated if his or her decision results in an undergraduate room being left vacant.\n\n- Students who decide to live out after the start of the academic year will always be required to give one full-term’s notice, otherwise a term’s Residence Charge in lieu of notice will be chargeable (for example: notice given on or before the first day of the Michaelmas term will not be liable for the Lent term’s Residence Charge; however, notice given after the first day of the Michaelmas term remainders responsible for the Lent term’s Residence Charge).  Notice must be given in writing and sent to the Finance Bursar\n\nWhat Then?\n----------\n\nAfter the end of Easter Term all correspondence and decisions regarding undergraduate room allocations will be handled by Karen Kempton (kak24) the College Accommodation Officer.  Only under exceptional circumstances will student initiated room swaps be permitted after the end of Easter Term each year.\n\n**When considering your choice, try to have a variety of rooms in mind. Once you know your position in the ballot, be realistic about your possible choices.  Look at the plans, go and look at rooms if you wish (people generally don't mind), and please turn up to choose on time.**\n\n**Please note that if anyone does not submit their name before the allotted time they will not be included in the ballot. They will be placed at the bottom of the appropriate list, post-ballot.**\n\n**Above all, don't worry about it!  Please contact me with any doubts, queries or problems.**\n\nMary Hughes\n\nRCSA Vice President 2012/13",
    "name": "Current First Years",
    "parentid": "/",
    "type": "page",
    "weight": 1
  },
  {
    "_id": "/thirdYears",
    "body": "What to do if you are in the undergraduate room ballot:\n\n1. Write your name(s) on a piece of paper and put it in the appropriate ballot box in the Plodge by 1pm on Saturday 16th Feb.\n\n2. Turn up for the ballot on Sunday 17th Feb (7pm JCR). The order of the draw will be the order of choosing.\n\n3. Check the JCR from Monday 18th Feb for your choosing time.\n\n4. Turn up to choose on Wednesday 27th Feb at least 5 minutes early to see which rooms are still available.\n\nGroups:\nIf you want to ballot in a group, put all the names on one piece of paper and **ensure that every member of the group has signed it** before placing it in the ballot box. Groups must be limited to a maximum of 5. You will be placed in the order that the names appear on the piece of paper.\n\nPlease be aware that continuing into the 4th year, your room rents will rise as the college only fixes them for three years.  The room rent bands will be posted on the JCR notice board with the plans on Saturday 9th Feb.\n\nWhat about Romsey Terrace?\n--------------------------\n\nThanks to the efforts of Rosalyn Old and Chris Halcrow two years ago, a promise was extracted from the Warden and put on a piece of paper that Romsey Terrace wouldn’t be used again. Thankfully, College are keeping this promise and 3 rooms in 3 Sylvester Road have been made available to 3rd years going into 4th year. They are Best rooms, so if the bottom three in the ballot don’t want them I will make them available to the first 3 people who do in the 3rd year ballot (more info on that when the choosing order is set!)\n\nSets and Flats\n--------------\n\nAll individuals who wish to choose a set or flat must ballot together, i.e. sets or flats can only be filled by people who are directly next to each other in the ballot. This means that an individual cannot choose one room in a flat or set and then hold it for other individuals further down the ballot.\n\nRound 2\n-------\n\nThe second round is designed to allow individuals to fill any unfilled flats and sets that were not filled by groups in the first round.  It also allows people to swap into fresher rooms. However, there must be a convincing reason for that change and the fresher room must be the same price or more expensive, so as to prevent the fresher pool becoming too expensive.  All swaps are at the Vice President’s discretion.\n\n\nWhat Rooms Are Available?\n-------------------------\n\nWithin the main college building there approximately 300 rooms, ranging in price, en suite/shared, view etc. This also includes a small number of sets (house two) and flats (house three). These sets and flats, however, often go early on in the ballot.\n\nThe college owns houses on Adams Road and Sylvester Road; approximately 80 rooms will be available to undergraduates.\n\nPlans, full room lists, predicted rents and facilities information will be available on the notice boards in the JCR from Saturday 9th Feb.\n\nLiving Out\n----------\n\nNobody has to live out of college accommodation, but you may do so if you wish. However, you will not receive a living out allowance as the choice is voluntary. If you decide to live out, you should contact the University Accommodation Service at Kellet Lodge, Tennis Court Road, or visit http://www.accommodation.cam.ac.uk, who should be able to help you find appropriate accommodation. If you are going to live out, inform me and do not enter the room ballot.  If you are considering living out, please note:\n\n - Those who opt to live out at the ballot stage cannot opt back in and expect to be accommodated.  Only after the freshers have been allocated rooms in the first week in September will it be clear whether there are rooms available.\n\n - If a student takes part in the ballot and subsequently opts to live out, he or she will have permanently deprived him/herself of the room allocated; if he or she subsequently opts back in, the room allocation is likely to take place at the earliest only after the freshers have been allocated rooms in the first week in September.\n\n - A student who opts to live out prior to the end of Easter Term (for 12/13 this is Friday 14 June 2013) will have no obligation for Residence Charge in the Michaelmas term, even if his or her decision results in a room being left empty.\n\n - A student who opts to live out after the end of Easter Term will be required to pay a term’s Residence Charge for the room he or she had been allocated if his or her decision results in an undergraduate room being left vacant.\n\n - Students who decide to live out after the start of the academic year will always be required to give one full-term’s notice, otherwise a term’s Residence Charge in lieu of notice will be chargeable (for example: notice given on or before the first day of the Michaelmas term will not be liable for the Lent term’s Residence Charge; however, notice given after the first day of the Michaelmas term remainders responsible for the Lent term’s Residence Charge).  Notice must be given in writing and sent to the Finance Bursar\n\nWhat Then?\n----------\n\nAfter the end of Easter Term all correspondence and decisions regarding undergraduate room allocations will be handled by Karen Kempton (kak24) the College Accommodation Officer.  Only under exceptional circumstances will student initiated room swaps be permitted after the end of Easter Term each year.\n\n**When considering your choice, try to have a variety of rooms in mind. Once you know your position in the ballot, be realistic about your possible choices.  Look at the plans, go and look at rooms if you wish (people generally don't mind), and please turn up to choose on time.**\n\n**Please contact me with any doubts, queries or problems.**\n\nMary Hughes\n\nRCSA Vice President 2012/13",
    "name": "Current Third Years",
    "parentid": "/",
    "type": "page",
    "weight": 3
  },
  {
    "_id": "/secondYears",
    "body": "What to do:\n\n1. Check the JCR for the revised order of last year's choosing (JCR notice boards from Saturday 9th Feb)\n2. If you want to form a new group with no more than 5 people, please notify me by email \n(meh65) by 1pm Saturday 16th Feb. The position of the new group will be determined by the average position of its members. If you want to remain in the same group as last year, please also email me with your names so I can ensure a newly formed group won’t separate your group.\n3.  Check the revised ballot order from Sunday 17th Feb for your choosing time\n4. Turn up to choose on Monday 25th February **at least 5 minutes early**\n\nSets and Flats\n--------------\n\nAll individuals who wish to choose a set or flat must ballot together, i.e. sets or flats can only be \nfilled by people who are directly next to each other in the ballot. This means that an individual \ncannot choose one room in a flat or set and then hold it for other individuals further down the \nballot. Second years with ambitions of sharing a set or flat, but who are not directly next to each \nother, will therefore have to re-ballot. The only exception to this rule is where two individuals from \ndifferent years wish to live together in a set. In this case, as they are not able to directly ballot \ntogether, the pair must inform the Vice President before the choosing process begins.\n\nRound 2\n-------\n\nThe second round is designed to allow individuals to fill any unfilled flats and sets that were not filled by groups in the first round.  It also allows people to swap into fresher rooms. However, there must be a convincing reason for that change and the fresher room must be the same price or more expensive, so as to prevent the fresher pool becoming too expensive.  All swaps are at the Vice President’s discretion.\n\nWhat Rooms Are Available?\n-------------------------\n\nWithin the main college building there approximately 300 rooms, ranging in price, en suite/shared, view etc. This also includes a small number of sets (house two) and flats (house three). These sets and flats, however, often go early on in the ballot.\n\nThe college owns houses on Adams Road and Sylvester Road; approximately 80  rooms will be available to undergraduates.\n\nPlans, full room lists, predicted rents and facilities information will be available on the notice boards in the JCR from Saturday 9th Feb.\n\nLiving Out\n----------\n\n\nNobody has to live out of college accommodation, but you may do so if you wish. However, you will not receive a living out allowance as the choice is voluntary. If you decide to live out, you should contact the University Accommodation Service at Kellet Lodge, Tennis Court Road, or visit http://www.accommodation.cam.ac.uk,  who should be able to help you find appropriate accommodation. If you are going to live out, inform me and do not enter the room ballot.  If you are considering living out, please note:\n\n- Those who opt to live out at the ballot stage cannot opt back in and expect  to be accommodated.  Only after the freshers have been allocated rooms in the first week in September will it be clear whether there are rooms available.\n- If a student takes part in the ballot and subsequently opts to live out, he or she will have permanently deprived him/herself of the room allocated; if he or she subsequently opts back in, the room allocation is likely to take place at the earliest only after the freshers have been allocated rooms in the first week in September.\n- A student who opts to live out **prior** to the end of Easter Term (for 12/13 this is Friday 15 June 2013) will have no obligation for Residence Charge in the Michaelmas term, even if his or her decision results in a room being left empty.\n-  A student who opts to live out **after** the end of Easter Term will be required to pay a term’s Residence Charge for the room he or she had been allocated if his or her decision results in an undergraduate room being left vacant\n- Students who decide to live out after the start of the academic year will always be required to give one full-term’s notice, otherwise a term’s Residence Charge in lieu of notice will be chargeable (for example: notice given  on or before the first day of the Michaelmas term will not be liable for the Lent term’s Residence Charge; however, notice given after the first day of the Michaelmas term remainders responsible for the Lent term’s Residence Charge).  Notice must be given in writing and sent to the Finance Bursar\n\nWhat Then?\n----------\n\nAfter the end of Easter Term all correspondence and decisions regarding undergraduate room allocations will be handled by Karen Kempton (kak24) the College Accommodation Officer.  Only under exceptional circumstances will student initiated room swaps be permitted after the end of Easter Term each year.\n\n**When considering your choice, try to have a variety of rooms in mind. Once you know your position in the ballot, be realistic about your possible choices.  Look at the plans, go and look at rooms if you wish (people generally don't mind), and please turn up to choose on time.**\n\n**Please contact me with any doubts, queries or problems.**\n\nMary Hughes\n\nRCSA Vice President 2012/13",
    "name": "Current Second Years",
    "parentid": "/",
    "type": "page",
    "weight": 2
  },
  {
    "_id": "/S/S5",
    "allocations": {
      "2012": "Kirsten Chaplin",
      "2013": "Daisy Pope",
      "2014": "Kirsten Chaplin"
    },
    "bathroomsharing": 1,
    "body": "Some people might describe this as an absolute beast of a room, and they'd probably be wrong. However, it is a very nice room, though oddly shaped, with a **diagonal** wall that upon first inhabiting the room will **mess with your mind**. After adjusting to the concept of diagons, you'll find that you've got a tranquil number at the very end of the college building with a nice view across the gardens. There's a decent balcony too, and you can see onto Adams Road and some netball courts too. There's also a second window/door to a fire exit area, which essentially doubles up as a second balcony, though anyone can enter it from the staircase. A large amount of overhead storage makes up for having only 4 shelves and also there is a quite simply **outstandingly brilliant** kettle, which can **bubble, bubble** without any **toil and trouble** to make you a good cup of tea or coffee day or night!",
    "floor": 2,
    "name": "S5",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D7",
    "allocations": {
      "2012": "Max Bougeard",
      "2013": "Jiaying Yan",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "I *love* this room. I think it's perfect for any gym enthusiast. Plenty of floor space so perfect for anyone looking to get the burn going doing reps of press ups, plank and of course side scramp. Really allows you to build up the craduloids and the flannids. Musician below which means free work out music, and trust me that **really** helps when you're just trying to power through the last few mins of a daily workout. Bit low on natural light.",
    "floor": 1,
    "name": "D7",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "name": "F18 (Fellow's Room)",
    "parentid": "/F",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 3,
    "_id": "/F/F18",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/4AR/4AR-12",
    "allocations": {
      "2012": "Olegs Osmjans",
      "2013": "John Mulvey",
      "2014": "Thomas Southern "
    },
    "bathroomsharing": 0,
    "body": "As it is a value room, it is smaller than most college rooms. But do not despair there is still enough room to stand up and move without hitting your head. You could also swing a cat, but it would have to be a rather patient cat that didn't mind being hit on the head a bit. It has excellent in term storage but no out of term storage. Your room has a wardrobe , two spacious cuboards and a big storage gap under the window seat. You also have the top of the window seat which can be used for sitting on, curling up on, sleeping on, etc the possibilities are endless.( As long as they can fit into about a square meter, thus setting up an airport is probably out). The room comes with two chairs a working chair and a relaxing chair. The room would be more spacious without the big chair, but for all you people with at least 1 friend that hates sitting on beds. This is the room for you. Location wise its close enough to get to college easilly but far enough away that you can work without noise even when a big ent is on. The bathroom is between 4 but on the other hand it is as bigger than your room and space will not be an issue. An excellent feature of this room is that it has a kitchen on the same floor, allowing for easy food access. The kitchen is small but if your entertaining there is a much larger kitchen on the ground floor.\n\nThus this room would suit a shortish, friendless person with a love of cooking and no desire to set up a room based airport.\n\nThough tall people would not have a massive problem and could go to thier friends room when meeting. So don't not pick it on that account.\n\nAlso think of all the extra drink / cake / hats / photographs of people called kenneth you could buy with the money saved by having a value room.",
    "floor": 2,
    "name": "Room 12",
    "parentid": "/4AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/L/L11",
    "allocations": {
      "2012": "David Hoare",
      "2013": "Bryn Pickering",
      "2014": "Becky Price"
    },
    "bathroomsharing": 2,
    "body": "Small cupboard above wardrobe for holiday storage.\nThe room has very creaky floors (as does L12) but a picture-perfect view of the lake.",
    "floor": 3,
    "name": "L11",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/M/M11",
    "allocations": {
      "2012": "Cameron Gardner",
      "2013": "James Pinder",
      "2014": "Tom Latimer"
    },
    "bathroomsharing": 2,
    "body": "Nice standard fresher room, good view of garden. Plenty of space, tiny balcony (big enough to chill beer in winter provided your balcony mate doesn't nick it). Kitchen upstairs is pretty tiny and stairs are a bit of a pain, but not as bad as some other staircases. Bed seems to get put facing into room, if you put it against the wall you get much more space.",
    "floor": 3,
    "name": "M11",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/I/I11",
    "allocations": {
      "2012": "Algirdas Baskys",
      "2013": "Robert Seaton",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "I11 has a shared balcony, and lockable cupboard for storing things during vacations. The kitchen is up one floor (or down two). It's one of those L shaped rooms. Unfortunately, there's (next to?) no wifi reception.",
    "floor": 3,
    "name": "I11",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/P/P1",
    "allocations": {
      "2012": "Shonit Shah",
      "2013": "Liang Ng",
      "2014": "Liang Ng"
    },
    "bathroomsharing": 1,
    "body": "Noise from the bar, noise from the bop room, noise from the walkway, noise from drunken people lingering around the staircase outside P. There's some weird dripping noise within the walls and also engine sounds from on top(I genuinely don't know why). Nice morning light. Nice and friendly bedder. Opposite the nurse office. You can crawl your way there if you fall sick.",
    "floor": 1,
    "name": "P1",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D17",
    "allocations": {
      "2012": "Matej Hamas",
      "2013": "Christopher Khoo",
      "2014": "James Sandow"
    },
    "bathroomsharing": 2,
    "body": "Decent size and never a problem with noise. Very nice view over the gardens. Small balcony shared with someone on E staircase (I think). Wardrobe with mirror on inside of door. Kitchen up one flight of stairs. Lugging stuff up 3 flights of stairs at beginning of term not the most fun I've ever had...",
    "floor": 3,
    "name": "D17",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R6",
    "allocations": {
      "2012": "Dylan Ede"
    },
    "bathroomsharing": 1,
    "body": "This room is nice and large, it is on one of the bends in college so has slightly more room than normal room hence being \"best\". To give an idea of size during conference periods this room has two beds and is sold as a twin. The room was refurbised for October 2011 so has a very nice bath room though the shower hose is a little short. The wifi signal is variable across the room ranging from perfect to weak. There are two network ports. The french windows to the balcony lie at one end of the room leading to one end being nice and bright and the other quite dingy. Unfortunately the desk and the pinboard are at the diny end of the room, though housekkeping don't mind if you rearrange the furniture. There is a sizavle overhead locker for vacation storage and being at the end of college the room is very quiet.  Shares balcony with Q6 - nice pair of rooms, and are mirror images of each other.",
    "floor": 2,
    "name": "R6 (Guest Room)",
    "parentid": "/R",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/1S/1S-5",
    "allocations": {
      "2012": "Tom Sanford",
      "2013": "James Richards",
      "2014": "James Richards"
    },
    "bathroomsharing": 0,
    "body": "A very decent room for a standard. It's a good size, and gets a fair amount of light from the two windows in the day time (although its overhead electric light is a bit weak, so it can get rather dim in the evenings). The room does look out over the car park, which isn't a fantastic view, but there's very little disturbance from the road, as Sylvester Road is pretty quiet. It doesn't share a wall with any other rooms and the soundproofing is pretty good in 1SR, so you barely ever hear anything from other bits of the house. Storage space is a bit limited, but there's a cupboard right outside the room that you can overflow into if you run out.",
    "floor": 1,
    "name": "Room 5",
    "parentid": "/1S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A16",
    "allocations": {
      "2012": "Ross Mackie",
      "2013": "Ross Mackie",
      "2014": "Basil Woods"
    },
    "bathroomsharing": 2,
    "body": "Fairly average sized room I think, has a balcony shared with someone on B staircase with a good view of the gardens. The window is set back in the corner so the lighting isn't great in half of the room. Doesn't get Wifi as yet, and there isn't a great deal of holiday storage, just the cupboard above the wardrobe.\n\nCaitlin (crb48)",
    "floor": 3,
    "name": "A16",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/E/E4",
    "allocations": {
      "2012": "James Goodwin",
      "2013": "Star Tong",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Nice room, good view, good size, ensuite. Utterly surrounded by rooms with pianos - all the other rooms on this floor of E have pianos, and the adjacent room in D has one too. Makes for nice background music when doing work, but has yet to be never annoyingly loud. Easy access to gardens by using the door at the very bottom of E.",
    "floor": 0,
    "name": "E4",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J13",
    "allocations": {
      "2012": "Ioana Popovici",
      "2013": "Patrick Roddy",
      "2014": "Andreas Papadogiannakis"
    },
    "bathroomsharing": 3,
    "body": "Quite a small room right at the top of J staircase. There is no built-in wardrobe, which means it takes up quite a lot of the floor space. Also an annoying pillar in the corner which makes the room feel quite small. Re-arranging the room a bit makes things a bit better though. Good views over the front courtyard, and the staircase kitchen is on the same level, which is handy. Can be quite hard to get in to the room when you're carrying things as you have to wait for the landing door to close before you can reach the room door. Great balcony, which is probably about 2-3 times the size of the room, with sole access.\n\nNick Clegg used to live here.",
    "floor": 4,
    "name": "J13",
    "parentid": "/J",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/E/E12",
    "allocations": {
      "2012": "Kathryn Reid",
      "2013": "Michael Loffredo",
      "2014": "Katie Fox"
    },
    "bathroomsharing": 1,
    "body": "Garden facing with shared balcony, has a large wardrobe with holiday storage space and gets a reasonable amount of daylight. It's a neatly almost-square shaped room which makes it quite cosy. Radiator works properly (have heard that's not always the case) and has a nice blue felt noticeboard, not one of those horrible orangey ones. Generally a lovely room :)",
    "floor": 2,
    "name": "E12",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N11",
    "allocations": {
      "2012": "Unavailable",
      "2013": "Douglas Young",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "The room has a shared balcony, which, i'm sure, will be more of use in the summer! Large room, plenty of space. It has a 2 door wardrobe with a big cupboard above for vacation storage.\nDoesn't get a lot of natural light, despite having a large window and a glass door, as they are kind of recessed away from the room (don't know if that makes sense...).\nUnfortunately, even though it is above the bar, you can't get wifi up here. :( There is only ever any noise from the bar if you leave your windows open, but that's never been a problem (why leave the bar before it closes? :P).\nIn the winter the room is lovely, because it has a massive radiator that warms to room up very well.\n\nBest bit: The view of the garden every morning (especially pretty now it's covered with snow)",
    "floor": 3,
    "name": "N11",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O4",
    "allocations": {
      "2012": "Sahil Shah",
      "2013": "Nick Peer",
      "2014": "Thomasina Perera"
    },
    "bathroomsharing": 1,
    "body": "No balcony, close to restaurant and cafe which is convenient, especially when raining.\n\nA lot of storage space and big wardrobe. Near the kitchen.\n\nVasilis",
    "floor": 1,
    "name": "O4",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E11",
    "allocations": {
      "2012": "James White",
      "2013": "Julius Schmidt",
      "2014": "Kuo Chan"
    },
    "bathroomsharing": 1,
    "body": "Plenty of sunlight, but sometimes this means that the room can become too warm. During the winter months direct sunlight hits the desk area so curtains need to be drawn until mid afternoon. By the summer, however, the sun is high enough not to cause any bother. The view isn't spectacular- it looks out onto a rooftop but you don't really notice it much. The room shares a balcony with D14. The overhead storage space is more than enough, and the wardrobe is of an average size. The rails to hang suits and shirts etc. is a bit short though. Wi-fi connection very rarely but sometimes with decent signal.",
    "floor": 2,
    "name": "E11",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R10",
    "allocations": {
      "2012": "György Dénes",
      "2013": "Rose Maxwell",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Its a nice enough room, overhead locker for vacation storage, small wardrobe, shelves etc. The main disadvantage with this room is that it's RIGHT next to the extractor fans from the canteen kitchen. The noise isn't too distracting during the day, but they seem to run constanly between 6am and 11:30pm, so its quite hard to get to sleep. This also means that the balcony is pretty big, unfortunately that means the room shape is a bit strange - one of the corners is missing - and that limits the possible furniture rearrangement, so it can feel smaller than it is. On the plus side, it gets a lot of light, although if its sunny, the light comes strongly onto the desk and so I have to shut the curtains so I don't get blinded. Also, the noise from the party room travels out along bin brook, so you can hear all the tunes in the bop really clearly. Which if you don't want to be at the bop gets annoying around 1am.",
    "floor": 3,
    "name": "R10",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/K/K4",
    "allocations": {
      "2012": "Forbes Lindesay",
      "2013": "Dylan Ede",
      "2014": "Dylan Ede"
    },
    "bathroomsharing": 1,
    "body": "K4 is a lovely big room, it's painted yellow, and because it's a Best you get nice blue curtains and a matching bedspread. The bath is also not grainy at the bottom, and the bathroom has nice blue and white tiling. You will need a long internet cable, though, as for no apparent reason the socket is on the other side of the room to the desk.\n\nApart from the occasional noise from parties in J8, the room is very quiet as few people live on K. This is because of the lift, which has the other benefit of making the staircase great for moving in and out.",
    "floor": 2,
    "name": "K4",
    "parentid": "/K",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/P/P9",
    "allocations": {
      "2012": "Dylan Morgan",
      "2013": "Peter Lacey",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Good sized room, convenient (close to bar, canteen, cafe) but no holiday storage space",
    "floor": 3,
    "name": "P9",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/sets/S24A",
    "allocations": {
      "2012": "Myfanwy-May Lambert",
      "2013": "Guy Smith",
      "2014": "Conor O'Smalley"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "Set 24a",
    "parentid": "/sets",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/1S/1S-4",
    "allocations": {
      "2012": "John Jarman",
      "2013": "John Jarman",
      "2014": "Katie Reid"
    },
    "bathroomsharing": 0,
    "body": "Advantages:\n\n - Huge Room - fits lots of people, suitable for indoor tennis\n - Easily fits two desks (though only one provided)\n - East, South AND West Facing Windows with a nice view of the garden\n - Nice mantelpiece for ornaments, if you have ornaments (but no fire, sadly)\n - 2 radiators so it doesn't get cold despite the number of windows\n - Next to the kitchen, so feels social/makes snacking easier\n - Opposite a shared loo, sink and internal phone (ooh)\n\nDisadvantages:\n\n - Showers are on the 1st floor and are shared (3 between 14)\n - Overlooked by 1A Sylvester\n - Next to kitchen, so gets smells and noise\n - There is some IT infrastructure just outside which makes an annoying buzzing sound, and you have an adjoining wall with the boiler (it doesn't often have late-night parties, though)\n - The door buzzer is so loud it makes you ruin your supervision work  when someone wants to come in\n\nGeneral:\n\n - Living in Sylvester Road does add on an extra 2-3 minutes to every journey to town/college (but if you are based in West Cambridge it is literally perfect)\n - Bike Storage outside the house (but a spate of bike thefts might put you off that)\n - Communal Kitchen is HUGE and has a seating area with brand new solid oak table\n - Communal bathrooms, the shower in which is easily big enough for two (or three, but four is probably pushing social acceptability)",
    "floor": 0,
    "name": "Room 4",
    "parentid": "/1S",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/A/A6",
    "allocations": {
      "2012": "Carnegie Abbott",
      "2013": "Katie Fox",
      "2014": "Katy Lehovsky"
    },
    "bathroomsharing": 1,
    "body": "Ground floor, nice size. Not the best light, and it doesn't have a balcony or window-doors that open onto the walkway - just standard windows. You can kind of get Wi-Fi, but it's not the best connection. It does have a spacious wardrobe and a nicely-sized cupboard above it for storing things over the holiday. Generally very comfortable to live in.\n\nHilla (hra27)",
    "floor": 0,
    "name": "A6",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E9",
    "allocations": {
      "2012": "Robin Smid",
      "2013": "Eliza Lass",
      "2014": "Angdi Lu"
    },
    "bathroomsharing": 1,
    "body": "Nice room with quite a lot of floor space. Does get quite dark, so you always need a lamp when working, but there's a really nice view onto the garden. It's above a floor of music students, which the person in E9 last years claimed you can hear all the time, but I don't think you can hear it unless you're outside on the staircase, or you've got your ear to the floor. A bit of a way to the kitchen, but the stairs are good for you!",
    "floor": 1,
    "name": "E9",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F21",
    "allocations": {
      "2012": "Shrish Parmeshwar",
      "2013": "Angdi Lu",
      "2014": "(fresher)"
    },
    "bathroomsharing": 3,
    "body": "I lived in this room 2008-9. It's a value room which means it's on the small side but you do pay less. Storage space is limited as the wardrobe is very small but it's nice and cosy plus it gets all the sunshine during the day. No balcony but nice views of the tree tops from the window plus roof access which makes for excellent views and party location. Plus it makes you suddenly very popular when there are fireworks. (This is all so long as the porters haven't found out about the key). Conveniently oppposite the kitchen although no kitchen cupboard specifically for the room.\n\nSarah\n\n\n\nI'm living in this room at the moment would just like to reiterate everything Sarah has said really. It is small, but it's also cheaper and it's nice having everything quite compact. The roof access is still there and is rather useful for views, fireworks, socialising and beer storage/chilling. Being right next to the kitchen is very handy, especially if you don't sleep much, as you can easily make a 4am snack with less chance of disturbing anyone. It also doesn't share a wall with the other two rooms, so you don't really share their noise. It has no lockable storage cupboard, but that's no problem if you're friends with someone who has.\n\nMartyn.",
    "floor": 4,
    "name": "F21",
    "parentid": "/F",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/L/L10",
    "allocations": {
      "2012": "Ryutaro Ikeda",
      "2013": "Peter Iltchev",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "There is a locker for holiday storage. The room is L shaped and rather large, although the bed placement takes up a lot of room; much better when turned 90 degrees and moved against wall.",
    "floor": 3,
    "name": "L10",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/B/B6",
    "allocations": {
      "2012": "Hannah Williams",
      "2013": "Clare Scott",
      "2014": "Fiona Howells"
    },
    "bathroomsharing": 1,
    "body": "Great room. Quite recently refurbished, pretty big but probably a normal standard plus room really, has a holiday storage locker, wardrobe's pretty small but that's no big deal. No mirror in the main room but it's on the 'waiting list' to get one, nice soft blue felt notice board (I know that sounds weird but its nice not having a horrible hard one when I like to cover it in stuff)...erm, the last person said it seemed hard to heat, but I've found it's been easy to keep it nice and warm except for when it got REALLY cold. \nOh, and HUGE bonus, it's directly opposite the side gate into college so moving in and out is as easy as it could be I think!\nOn the whole, I've loved this room and would happily choose it again, hope whoever gets it next enjoys it! (P.s. that red stain on the wall behind the towel rail isn't blood, it's red hair dye...my bad!)",
    "floor": 0,
    "name": "B6",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E3",
    "allocations": {
      "2012": "Rose Ward",
      "2013": "Laura Ridley",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Opposite the flats so can get noisy but this isn't too bad. Generally an all right room, especially as it has a piano and is ground floor. Not too big but fine. 2 door cupboard and lockable space above. Wifi has a very poor signal, but a long ethernet cable reaches the desk. There is an annoying gurgling in the pipes directly behind the bed some nights, but again it's not too bad. Good in Winter, as seems to heat up better than other rooms. Overall, a good room.",
    "floor": 0,
    "name": "E3",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O13",
    "allocations": {
      "2012": "Leandros Sideris",
      "2013": "Jack Eckersley",
      "2014": "Peter Iltchev"
    },
    "bathroomsharing": 2,
    "body": "Very noisy wind whistles through the door and the floor boards are creaky. Nice view though.",
    "floor": 4,
    "name": "O13",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D12",
    "allocations": {
      "2012": "Dan Green",
      "2013": "Miriam Shaul",
      "2014": "Nick Peer"
    },
    "bathroomsharing": 1,
    "body": "Advantages: A spacious room with plenty of wardrobe space. Good views of the garden. Balcony, rather than a walkway, outside the window.\n\nDisadvantages: No direct sunlight, so the room can be a little gloomy on cloudy days. On the other hand, there are no issues with sun shining on your laptop screen or the room getting really hot. No wi-fi signal at the moment.",
    "floor": 2,
    "name": "D12",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H7",
    "allocations": {
      "2012": "Emily Fernandes",
      "2013": "Lucy Cooke",
      "2014": "Olivia McKay"
    },
    "bathroomsharing": 1,
    "body": "A nice room overlooking the roof of the Auditorium, H7 is pretty much identical to all of the garden facing rooms on this level (and the level below). There is a private balcony, one flight of stairs down to the kitchen, and handy for the Auditorium, Games Room, Library and Plodge. However, H staircase does not extend to the ground floor and must be accesses via the first or second floor walkways on the college side.",
    "floor": 2,
    "name": "H7",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O12",
    "allocations": {
      "2012": "Barney Woodhouse",
      "2013": "Evan Herbert",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "O12",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A4",
    "allocations": {
      "2012": "Sam Brooks",
      "2013": "Clare Dawson",
      "2014": "Avish Patel"
    },
    "bathroomsharing": 1,
    "body": "A4 is a lot smaller than many of the other standard plus rooms I have seen. It gets hardly any natural light as the view from the window is a large tree. The radiator in the room doesn't seem to regulate the temperature very well either. It is either too hot or too cold. There is a fellow's room right next door so you have to be careful with loud music. There is no separate balcony, it just leads straight onto the main balcony. On the plus side, there is a cupboard above the wardrobe for extra storage. No wireless internet as A staircase is a bit far out.",
    "floor": 0,
    "name": "A4",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C7",
    "allocations": {
      "2012": "Jawaad Farrukh",
      "2013": "Kiyanoush Mirshahi",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Nice spacious room with ensuite. Small-ish wardrobe, but a lockable storage cupboard above it that comes in very handy for the holidays. Kitchen is two floors below which can sometimes be a pain. Room faces out on to a walkway. This is nice when friends walk past to chat etc, less nice when they walk past and bang on your window when drunk. Room is generally quite dark in the day, but gets lighter at night when the walkway light comes on right outside the window. Also quite often an annoying clicking noise coming from the pipes in the bathroom which is pretty disturbing when trying to sleep/work.",
    "floor": 1,
    "name": "C7",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O3",
    "allocations": {
      "2012": "Aakash Patel",
      "2013": "Lewis Blackwood",
      "2014": "Jessica Radley"
    },
    "bathroomsharing": 1,
    "body": "O3 has a piano. But it's flat.",
    "floor": 1,
    "name": "O3",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/S/S10",
    "allocations": {
      "2012": "Nicholas Peer",
      "2013": "Matthew Langford",
      "2014": "Gunsu Han"
    },
    "bathroomsharing": 2,
    "body": "This room is a fair size so long as the furniture is arranged to make best use of space. A reasonable amount of storage space during term, with a large wardrobe and separate chest of drawers but no lockable cupboards so nothing for the vacation. SW facing window so plenty of daylight, and the view is over the gardens. Small single balcony. As far as I know the room doesn't get Wifi. This and several other rooms on S staircase (and probably others nearby facing the garden) tend to get a fair number of small flies and ladybirds coming in, especially in warmer weather and even when the windows are shut.\n\nAdam (as929)",
    "floor": 4,
    "name": "S10",
    "parentid": "/S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-9",
    "allocations": {
      "2012": "Curtis Bonnell",
      "2013": "Vivek Sharma",
      "2014": "Tilly Roberts"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1S/1S-11",
    "allocations": {
      "2012": "Harry Edwards",
      "2013": "Harry Edwards",
      "2014": "Barney Woodhouse"
    },
    "bathroomsharing": 0,
    "body": "A very nice, square room, which is very useful in this case. It's excellent value for a value and its shape means that there's plenty of space. Good lighting due to two windows, and north (ish) facing, so doesnt get too much sun, although this can be a disadvantage if you like sun. It has a handy alcove which doesnt take too much space out of the room but which I currently have two suitcases and lots more stored in.",
    "floor": 2,
    "name": "Room 11",
    "parentid": "/1S",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/sets/S21B",
    "allocations": {
      "2012": "James Sandow",
      "2013": "Stephanie Brown",
      "2014": "Zachary Levin"
    },
    "bathroomsharing": 2,
    "body": "Cupboard last year, cosy room this year... its lovely tho really.\n\nShared bathroom off hallway. Front door on balcony overlooking river and backdoor of Set 24. ;)",
    "floor": 2,
    "name": "Set 21b",
    "parentid": "/sets",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-5",
    "allocations": {
      "2012": "Katharine Taylor",
      "2013": "Max Baxter-Allen",
      "2014": "Tom Stockwood"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 5",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D19",
    "allocations": {
      "2012": "Kuo Chan",
      "2013": "Lucy Jenner",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "D19",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/I/I14",
    "allocations": {
      "2012": "Julian Mack",
      "2013": "David Lowis",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "I14 is a lovely room. Your view of the gardens is super nice and, because you are on the highest floor, you get a shared balcony AND a fire-escape (which is really just a tiny balcony meant to be used as a mini-fridge in the winter). Bathroom is not refurbished but fine. There is no overhead storage. Phone signal is really amazing and WiFi is not bad either. It's not a huge room and the second chair will always be awkwardly placed either in front of your wardrobe or your balcony door, but whaddaya do?",
    "floor": 4,
    "name": "I14",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D5",
    "allocations": {
      "2012": "Oscar Dub",
      "2013": "Alvo von Cossel",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 0,
    "name": "D5",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M10",
    "allocations": {
      "2012": "Charlotte Kirkman",
      "2013": "Matt Hopgood",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "M10",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F4",
    "allocations": {
      "2012": "Brian Lee",
      "2013": "Chi Leung",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 0,
    "name": "F4",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B13",
    "allocations": {
      "2012": "Alex Marshall",
      "2013": "Gregory Barbour",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Garden facing, shared balcony with room C12. Gets plenty of daylight (standard floor-to-ceiling window/door), but the sun rarely gets round here except during the summer months, so doesn't get a lot of sunlight or natural heat. No WiFi at the moment. Decent overhead locker space for vacation storage, wardrobe is nice and big - three doors wide rather than two. Handy shelf in the bathroom for storing bits and bobs. The taps are a bit leaky unless you twist them pretty hard, and it gets quite cold next to the balcony door because there is no double-glazing. The room stays pretty warm with the radiator on low though, because of the other rooms around it.",
    "floor": 2,
    "name": "B13",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E6",
    "allocations": {
      "2012": "Kiu Yip",
      "2013": "Alexander Maynard",
      "2014": "Alice Zanghi"
    },
    "bathroomsharing": 1,
    "body": "THIS ROOM HATES PHONES. Getting any signal at all will become a huge achievement. But you eventually become used to it/give up. Get Whatsapp. And your view outside your window is of the court rather than the garden meaning when people get home at 3am it can be noisy right outside. The piano is in quite bad condition: the pedals don't work and some of the keys are in need of repair but other than that the room is quite good. It's not as wide as some other standard plus rooms and some of the sockets are awkwardly placed behind the piano but it has a decent-sized lockable storage cupboard above the big wardrobe and it has good central heating and shelf space. Oh but you're right next to the bedder's storage room. Learn to love waking up to shouting/the radio at 8am every weekday. At least the wi-fi's quite good.",
    "floor": 0,
    "name": "E6",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q11",
    "allocations": {
      "2012": "Unavailable",
      "2013": "Lucia Coulter",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "Q11",
    "parentid": "/Q",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R3",
    "allocations": {
      "2012": "Favourite Frizell",
      "2013": "Kezia Burkett",
      "2014": "Dylan Morgan"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "R3",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R12",
    "allocations": {
      "2012": "Jonathan Stephenson",
      "2013": "Christopher Goodway",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "R12",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C14",
    "allocations": {
      "2012": "Bethan Louise",
      "2013": "Katie Spencer",
      "2014": "Guy Smith"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "C14",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H14",
    "allocations": {
      "2012": "Myran Lynch-Bathgate",
      "2013": "Yan Ko",
      "2014": "Nicole Manion"
    },
    "bathroomsharing": 2,
    "body": "A decent sized room with nice views of the garden. There's a shared balcony with H13, which isn't huge but will be good in warmer weather, and an emergency exit balcony to I13. Plenty of storage space with a big wardrobe. It's opposite the kitchen which is nice and convenient. No lockable storage in the room but H14's cupboard in the kitchen can be locked with a padlock. The desk area can get a little chilly as it's by the balcony door/window which is a bit drafty.",
    "floor": 4,
    "name": "H14",
    "parentid": "/H",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/N/N7",
    "allocations": {
      "2012": "Nanjie Zhou",
      "2013": "Alice Udale-Smith",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "N7",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R1",
    "allocations": {
      "2012": "Richard Odle",
      "2013": "Danielle Shipp",
      "2014": "Umar Patel"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "R1",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-16",
    "allocations": {
      "2012": "Gemma Nash",
      "2013": "Katherine Somerville",
      "2014": "Cameron Gardner"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 16",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/D/D10",
    "allocations": {
      "2012": "Christine Zhou",
      "2013": "Shivani Khosla",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "**Positives**: En-suite, decent size , overhead locker, shelf under mirror in bathroom, shower over bath. Quiet part of the college.\n\n**Negatives**: Pale cream coloured walls, lack of natural light due to facing college, exactly furthest away from both of the staircase kitchens as midway between them. Really bad view. Also you have to deal with people walking constantly across your window.\n\nThere are definitely better rooms.",
    "floor": 1,
    "name": "D10",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M13",
    "allocations": {
      "2012": "Nadia Kahei-l",
      "2013": "Oliver Cottrell",
      "2014": "Oliver Cottrell"
    },
    "bathroomsharing": 2,
    "body": "A lovely room - it is on the top floor, which can be a bit annoying, but it keeps you fit. Nice balcony, shared with M14, with genuinely the best view in college, as it is right in the middle, so you can see right across the whole garden. The bathroom is fine etc. It's right opposite the kitchen which is good in terms of making your breakfast.",
    "floor": 4,
    "name": "M13",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O7",
    "allocations": {
      "2012": "Ben Garner",
      "2013": "Harry Kalms",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "O7",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P7",
    "allocations": {
      "2012": "Sara Adams",
      "2013": "Sara Adams",
      "2014": "David Hoare"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "P7",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R9",
    "allocations": {
      "2012": "Minna Song",
      "2013": "Sian Taylor",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "no holiday storage facilities.",
    "floor": 3,
    "name": "R9",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-16",
    "allocations": {
      "2012": "Christopher Silvester",
      "2013": "Abigail Harris",
      "2014": "Charlotte Kirkman"
    },
    "bathroomsharing": 0,
    "body": "A nice space with a lovely view over the gardens but has limited natural light(with a fairly big window too). Has a sink.\nShares a bathroom with 4 other rooms and two toilets between 9 others. Although this sounds like quite a lot of people it is quite manageable.\nThe big kitchen on this floor comes with a dining table and is a good socializing area.",
    "floor": 1,
    "name": "Room 16",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/sets/S30B",
    "allocations": {
      "2012": "James Disley",
      "2013": "Alexander Dickinson",
      "2014": "Kendrick To"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "Set 30b",
    "parentid": "/sets",
    "rentband": 4,
    "type": "room",
    "weight": 1
  },
  {
    "_id": "/5AR/5AR-3",
    "allocations": {
      "2012": "Harshil Raisinghani",
      "2013": "Mary Hughes",
      "2014": "Daniel Chatfield"
    },
    "bathroomsharing": 0,
    "body": "Palatial room...so jealous",
    "floor": 0,
    "name": "Room 3",
    "parentid": "/5AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-12",
    "allocations": {
      "2012": "Lotte Reinbold",
      "2013": "Lydia Burton",
      "2014": "Joe Mullaly"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 12",
    "parentid": "/5AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R7",
    "allocations": {
      "2012": "Maria Varnava",
      "2013": "Emily Fernandes",
      "2014": "James White"
    },
    "bathroomsharing": 1,
    "body": "R7 is a really big room, much bigger than R8. It's also got a new springy-carpet as well.",
    "floor": 2,
    "name": "R7",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-10",
    "allocations": {
      "2012": "Ruairi Dorrity",
      "2013": "Charlotte Kirkman",
      "2014": "Helen Briggs"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 10",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1S/1S-7",
    "allocations": {
      "2012": "Judd Harrison",
      "2013": "David Hoare",
      "2014": "Mark Driver"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 7",
    "parentid": "/1S",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-8",
    "allocations": {
      "2012": "William Nyere Plastow",
      "2013": "Robert Richardson",
      "2014": "Phillipa Carr"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 8",
    "parentid": "/4AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-18",
    "allocations": {
      "2012": "Heather Holland",
      "2013": "Amelia Hewill",
      "2014": "Myran Lynch-Bathgate"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 18",
    "parentid": "/2AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-7",
    "allocations": {
      "2012": "Oliver Allbless",
      "2013": "Brian Wang",
      "2014": "Carlos Vazquez"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 7",
    "parentid": "/6AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/S/S3",
    "allocations": {
      "2012": "Emily Lodge",
      "2013": "Jawaad Farrukh",
      "2014": "Tom Arneil"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "S3",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-1",
    "allocations": {
      "2012": "Conor O'Malley",
      "2013": "Arthur Henderson",
      "2014": "Emma Hildyard"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 1",
    "parentid": "/1S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-6",
    "allocations": {
      "2012": "Emma Stacey",
      "2013": "Heather Keenan",
      "2014": "Ben Peacock"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 6",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-13",
    "allocations": {
      "2012": "Henry Wiles",
      "2013": "Josh Stratford",
      "2014": "David Lowis"
    },
    "bathroomsharing": 0,
    "body": "A great room for the price, the lockable cupboard is huge, I fitted tow people stuff and more in there and there was still room for me to climb in and rearrange it all. \n\nIts a lovely warm room though it is a bit dark as there is only a small window. Because of its shape it can be difficult to arrange furniture but if you get it right it feels really nice and cosy.\n\nThere is a low ceiling on the way up the stairs but only really an issue if your over 5'8\" or wear really high heels. \n\nThe kitchens in the house are far better than college but some of the other houses have nicer ones.\n\nThere are 2 shower/baths and one bath and one shower in the house and 5 toilets so there's almost always one free. Top floor has a bath but there is a sloped roof over the top so need to watch your head when you stand up.",
    "floor": 2,
    "name": "Room 13",
    "parentid": "/6AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/N/N3",
    "allocations": {
      "2012": "Cheng Zhang",
      "2013": "Peter Hall",
      "2014": "Laura Bampton"
    },
    "bathroomsharing": 1,
    "body": "The main special feature of this room is it's right above the bar, meaning you get a lot of noise at busy times. It has its advantages though - there's really good WiFi signal, you can hear when the bar is busy (just hope it isn't for a society dinner full of people you don't know) and you can get down there without getting wet. But don't even think about getting any work done on Friday or Saturday nights.\n\nDaylight isn't great as your window (which opens on to the garden walkway, by the way) both has net curtains, which you probably want to leave up, and is shaded by the balcony from the room above.\n\nThere's a big 3-door wardrobe with a nice big lockable cupboard above it, but like in many en-suites it's not in your room itself but in the entrance-way which is slightly annoying. Also the wardrobe tends to be quite dark as the door opens blocking the light, so if you're like me and need to differentiate between many subtly different shades of blue clothing, bring something to light it up with.",
    "floor": 1,
    "name": "N3",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q10",
    "allocations": {
      "2012": "Unavailable",
      "2013": "Ifeyinwa Frederick",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Marginally bigger than Q11, lift straight to bops or breakfast, useful for moving in, good views of the garden.",
    "floor": 4,
    "name": "Q10",
    "parentid": "/Q",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C2",
    "allocations": {
      "2012": "Richard Allitt",
      "2013": "Jonathan Schmidt-Swartz",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "nice size and shape\nnext to kitchen so a bit noisy- good if you get up early, not if you live near rowers\nvery small wardrobes\nnot much daylight, but ok if you have lots of lights on\ngood shower but poor ventilation so room can end up a bit steamy\ngood view of squirrels prancing/deer\nyellow walls\nlots of electic sockets",
    "floor": -1,
    "name": "C2",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/I/I10",
    "allocations": {
      "2012": "Matthew Thomas",
      "2013": "Hannah Williams",
      "2014": "Oliver Garner"
    },
    "bathroomsharing": 2,
    "body": "It looks like all the other shared bathroom rooms on the third floor. Its above the auditorium, so to get to it you have to go up J staircase, with its really narrow ground floor entrance, which is a bit of a faff if you're carrying a lot of stuff. Doesn't get wi-fi yet, being on the garden side, though next door in I9 does. Garden facing rooms are slightly bigger than the court facing ones, and have the overhead lockable storage, handy for the holidays, so that's a bonus.\n\nI staircase has the advantage of being on one of the staircases closest to the plodge, the laundry room, and all the teaching rooms.\n\nThe front doors of I9 and I10 lack the automatic closing mechanisms, so that it is possible to leave both doors open. This is quite nice if you get on well with the person you are sharing with.\n\nAt certain times of the year, when the planets align and the clouds part, the sun bounces off the roof of the Needham Research Institute on the other side of Bin Brook, through the trees. This unfortunate reflection is especially inconvenient if you choose to push the desk round to face the window, whereupon the beam of light shines directly at your face while you're trying to stare aimlessly out into space and burns holes in your retinas.",
    "floor": 3,
    "name": "I10",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O11",
    "allocations": {
      "2012": "Douglas Young",
      "2013": "David Sparkhall",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Due to facing out into the middle of the gardens, a lot of natural light comes though.\n\nThere is a cupboard for holiday storage above the wardrobe, needs a padlock to be brought separately.\n\nNo kitchen on 3rd floor, need to go upstairs to 4th floor kitchen.\n\nAny questions can be sent to me at dmr46@cam.ac.uk.",
    "floor": 3,
    "name": "O11",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R14",
    "allocations": {
      "2012": "Jennifer Mills",
      "2013": "Rosie Ward",
      "2014": "Lawrence Barrat"
    },
    "bathroomsharing": 3,
    "body": "One of the smallest rooms in college (but in the standard rent band), located on a corner so everyone can see in to your room, plenty of windows but unfortunate placing of the mirror means the only way to avoid being dazzled on bright days is to shut all your curtains. Has a nice balcony but I heard that a previous occupant did something terrible on it to desecrate it. Has a ceiling hatch which means you have tons of storage space for the vacation which is nice. Shower suffers from really poor water pressure and erratic temperature control.",
    "floor": 4,
    "name": "R14",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-14",
    "allocations": {
      "2012": "James Richards",
      "2013": "James White",
      "2014": "Timothy Pennington"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 14",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-11",
    "allocations": {
      "2012": "Alex Saunders",
      "2013": "Henry Wiles",
      "2014": "Matej Hamas"
    },
    "bathroomsharing": 0,
    "body": "First off, this is a 'value' room, so don't expect an en-suite, or much space.\nThat said, the bathroom door is directly opposite this room, so the walk to the bathroom is only 1m.\n\nPros:Top floor kitchen, with oven, 2 fridges, a freezer, 4 hobs, microwave and kettle.\nNearby bathroom with excellent shower.\n2 large lockable cupboards(set into the roof, so triangular)\n-one has shelves in, and a coat hanger rack.\n1 large window seat with storage under.\nSwively window with blind.\nLovely garden.\nExcellent downstairs kitchen.\nLaundry room right by house.\n\nCons:Top floor, so quite a walk when moving in.\nIt's pretty small - if you like to pace whilst thinking, or swing cats, this is not for you.\nCan get hot quickly in summer.\n\n____________\n\nIt's really smallllllllll compared to most rooms in college.",
    "floor": 2,
    "name": "Room 11",
    "parentid": "/4AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/D/D15",
    "allocations": {
      "2012": "Michael Little",
      "2013": "Nicole Manion",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "D15",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/N/N1",
    "allocations": {
      "2012": "Unavailable",
      "2013": "Shrish Parmeshwar",
      "2014": "Rohan Giblin"
    },
    "bathroomsharing": 1,
    "body": "Decent amount of holiday storage and hanging space, on the walkway, so no proper balcony, brick facing, so no garden view :( but is exactly 9 (large) paces from the bar, and probably the same from the cafe, I just haven't measured it yet. Can get quite noisy during friday nights, but it's not too much bother because of the early closing time of the bar.",
    "floor": 1,
    "name": "N1",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P3",
    "allocations": {
      "2012": "Lewis Blackwood",
      "2013": "Oliver Allbless",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "P3",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q7",
    "allocations": {
      "2012": "Henry Pritchard",
      "2013": "Steph French",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "This room is great for a standard & has a fantastic extra storage nook which no other bathroom-sharing rooms have (as far as I know). Decent balcony not on the walkway, and gets the morning sun. Close to the canteen = v convenient!",
    "floor": 3,
    "name": "Q7",
    "parentid": "/Q",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/sets/S30A",
    "allocations": {
      "2012": "Lajos Torok",
      "2013": "Harry Llanwarne",
      "2014": "Amadeus Carnegie"
    },
    "bathroomsharing": 2,
    "body": "Had to pay standard for the smaller room which is same size as in other sets which would only ask for value price, otherwise good",
    "floor": 2,
    "name": "Set 30a",
    "parentid": "/sets",
    "rentband": 2,
    "type": "room",
    "weight": 1
  },
  {
    "_id": "/A/A9",
    "allocations": {
      "2012": "Pui Lee",
      "2013": "Nicholas Jones",
      "2014": "Star Tong"
    },
    "bathroomsharing": 1,
    "body": "This is quite a large, comfortable room. It has no private balcony, the windows open out onto the long walkway that runs around college on the garden side. Privacy is not an issue though as nobody ever walks past. It also has a large wardrobe with a holiday storage locker. However, very poor television reception.",
    "floor": 1,
    "name": "A9",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D6",
    "allocations": {
      "2012": "Martin Weston",
      "2013": "Henry Jiao",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Reasonable sized room with a fair amount of holiday storage in a locker above the wardrobes. It gets Wifi pretty consistently, although with a fairly low signal. Not all that much sunlight, but that does come with the advantage of no sun shining directly onto your PC screen.\n\nThe obvious disadvantage is that it's on the ground floor and facing into the college, so noise from people congregating outside the room and talking can be a bit annoying if you're trying to work. Still, that doesn't happen all that often, and I've been happy here.",
    "floor": 0,
    "name": "D6",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N6",
    "allocations": {
      "2012": "Toni Jokinen",
      "2013": "Favourite Frizell",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "N6",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q4",
    "allocations": {
      "2012": "Kendrick To",
      "2013": "Priyesh Patel",
      "2014": "Abi Bevan"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "Q4",
    "parentid": "/Q",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q8",
    "allocations": {
      "2012": "Matthew Cottell",
      "2013": "Kamie Kingstone",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Standard sums it up. Standard layout, standard storage, standard (nice) view of gardens, standard bathroom. Shower is fine, has the usual fits of hot/cold when other people take showers, but not as bad as others. It's on high court, which you may or may not like, but is pretty convenient for bar, garden restaurant and JCR (and music room or nurse's office if they take your fancy?).\n\nHighlights\n----------\nLift on Q means much less effort moving in and out if you get a trolly that fits in it.\nCan just get wireless (not great signal) if you carefully position laptop. Can't rely on it though, just for those bandwidth quota breaches.\n\nBad points\n----------\nKitchen is a whole floor up and is poor, even as Robinson kitchens go.\n\nAlso, it has a name that sounds a bit like a small middle-eastern country.",
    "floor": 3,
    "name": "Q8",
    "parentid": "/Q",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/sets/S27B",
    "allocations": {
      "2012": "Peter Hall",
      "2013": "Jennifer Mills",
      "2014": "Martijn Bokkerink"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "Set 27b",
    "parentid": "/sets",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-3",
    "allocations": {
      "2012": "Amy Biggadike",
      "2013": "Dylan Morgan",
      "2014": "Kayani Kayani"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 3",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-21",
    "allocations": {
      "2012": "Fiona Johnson",
      "2013": "Angela Holloway",
      "2014": "Shivani Khosla"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 21",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-13",
    "allocations": {
      "2013": "Jimmy Campbell",
      "2014": "Lucy Jenner"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 13",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-14",
    "allocations": {
      "2012": "Manuel Hettich",
      "2013": "Tom Sanford",
      "2014": "James Clark"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 14",
    "parentid": "/6AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/sets/S24B",
    "allocations": {
      "2012": "Joseph Batey",
      "2013": "Henry Pritchard",
      "2014": "John Jarman"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "Set 24b",
    "parentid": "/sets",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-2",
    "allocations": {
      "2012": "Lydia Burton",
      "2013": "Alex Bentley",
      "2014": "Alex Bentley"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 2",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-17",
    "allocations": {
      "2012": "Sophie Smith",
      "2013": "Daniella Allard",
      "2014": "Charlotte Franklin"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 17",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-16",
    "allocations": {
      "2012": "Hannah Cowan",
      "2013": "Laurence Dudley",
      "2014": "James Baker"
    },
    "bathroomsharing": 0,
    "body": "Only a little less floor space than a standard room - it's only really value because of the low ceiling. It probably wouldn't suit anyone really tall who likes to jump but the low ceiling means there's no student-y pin board so feels much more homely. Good housekeeper too so bathrooms and kitchen are always kept clean. Oh and if you have loads of clothes it's also probably not the best room for you due to lack of wardrobe space.",
    "floor": 2,
    "name": "Room 16",
    "parentid": "/5AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/B/B2",
    "allocations": {
      "2012": "Bryony Watson",
      "2013": "Grace Atkinson",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "A massive room compared to the rest of the college, with a very nice en suite and decent shower. Opposite the kitchen and has almost immediate access to the gardens. 4 sets of electrical sockets, all sensibly placed around the room. There is holiday storage space, but the hanging space in the wardrobe is limited. The room tends to be quite gloomy, as the window (small compared to room size) looks Northwards and so never really gets the sun. The mirror in the bathroom is poorly located (behind the door). No Wifi. In theory, probably one of the best Standard Plus rooms.",
    "floor": -1,
    "name": "B2",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "name": "Room 6 (Fellow's/Graduate)",
    "parentid": "/1AS",
    "type": "room",
    "bathroomsharing": 0,
    "rentband": 0,
    "floor": 0,
    "_id": "/1AS/1AS-6",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/D/D9",
    "allocations": {
      "2012": "Luke Martin-Fuller",
      "2013": "Panayiotis Ioannou",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "It's a regular standard plus room on first floor.\n\nPros:\n\n + Spacious storage room.\n + There is place above the sink to put all your stuff.\n\nCons:\n\n - Piano player in this staircase. If you can't stand noise i wouldn't suggest this room.\n - Kitchen 2 floors up/down.",
    "floor": 1,
    "name": "D9",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C5",
    "allocations": {
      "2012": "Frederick Ashford",
      "2013": "Holly Carter",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Really nice room, spacious, big wardrobe, garden view, and one of the only bathrooms in college that has tiles (and a heated towel rail)! Kitchen is just downstairs. Only downside is that one of the rooms opposite has a piano which can be quite distracting when you're trying to work...Also the cleaner's cupboard is literally right outside the door and she's pretty loud every morning at 8.30am...Invest in some ear plugs!",
    "floor": 0,
    "name": "C5",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/I/I9",
    "allocations": {
      "2012": "Harriet Wade",
      "2013": "Rebecca Harrison",
      "2014": "George Barton"
    },
    "bathroomsharing": 2,
    "body": "A pretty standard 3rd floor room. There are no holiday storage facilities in the room. There is good access to Wifi due to its proximity to the library. The room faces over front court and, because it is South East facing, gets a large amount of sun in the mornings, which, on a sunny day, can be strong enough to wake you up. I staircase has no entrance onto Front Court itself, meaning you have to walk up J staircase first in order to get there.\n\nPeter (pjn32)",
    "floor": 3,
    "name": "I9",
    "parentid": "/I",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O1",
    "allocations": {
      "2012": "Avish Patel",
      "2013": "Tom Arneil",
      "2014": "Clare Scott"
    },
    "bathroomsharing": 1,
    "body": "The room is really big and there is a lot of wardrobe/floor/shelf space for term time. There's also a storage locker above the wardrobe for over the holidays. There's a shelf in the bathroom and an inner door separating the bathroom & wardrobe part by the front door from the main room. It's the closest room to the bar and and it's not noisy despite this. But you can hear the bar lift occasionally which could get annoying, I don't really mind it though. \n\nThe kitchen is right next door as well but tiny, the one at the top of the staircase is much bigger. \nNot much of a view, just looks out onto a walkway in college.\nThe Wifi connection is rubbish, even though you'd have thought being right above the cafe would mean it'd be ok. \n\nKaterina: kp374",
    "floor": 1,
    "name": "O1",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D3",
    "allocations": {
      "2012": "Samuel\tHolmes",
      "2013": "Gabrielle Harrison",
      "2014": "Zoe Silkstone"
    },
    "bathroomsharing": 1,
    "body": "Piano: Weber \"Duo-Art\" (old upright, large, ivory keys have mostly been chipped off)\n\nLongish rectangular room in slightly unusual arrangement: the piano, shelves and desk are on one side; the bed and coffee table are next to the radiator. Large three-door wardrobe with lockable holiday storage above.\n\nSmall entrance area connecting with bathroom. Relatively large floorspace especially considering the size of the piano.",
    "floor": 0,
    "name": "D3",
    "parentid": "/D",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M7",
    "allocations": {
      "2012": "Shershah Assadullah",
      "2013": "Tom Pearson",
      "2014": "Chris Derrick"
    },
    "bathroomsharing": 1,
    "body": "Reasonable sized room, great views down the length of the Gardens, looking out over Thorny Creek Cottage and the pond, shared balcony, plenty of storage space for the holidays (about 1.5x larger than available in many rooms)",
    "floor": 2,
    "name": "M7",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/C/C10",
    "allocations": {
      "2012": "Sereena Ansari",
      "2013": "Luting Chen",
      "2014": "Elle Mackenzie"
    },
    "bathroomsharing": 1,
    "body": "C10 is an good ensuite room in a quieter area of College (whoever wrote this is lying. It's fucking noisy when the lads get back from cindies at 4 in the morning [went via gardies of course] with their gash and head to the flats). The room is very spacious and the window opens onto the walkway which goes along most of the College, which is handy. The bathroom is really nice too. The only slight downside is that occasionally it can be a little dark, but it's absolutely fine with the lights on anyway.",
    "floor": 1,
    "name": "C10",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-18",
    "allocations": {
      "2012": "Mark Driver",
      "2013": "Douglas Robinson",
      "2014": "Jake Dyble"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 18",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C4",
    "allocations": {
      "2012": "Alexander Macnab",
      "2013": "Tom Stockwood",
      "2014": "Arturo Abruzzini"
    },
    "bathroomsharing": 1,
    "body": "Pros: C4 is at the quiet end of College. It has a lovely view out into the trees and across the back of the main building. The walkway is a nice little addition.\n\nDoor to the bathroom is off the main room and the cupboard has three bits and a large overhead part. \n\nCons: The room isn't overly bright, and sometimes you can smell things when someone's cooking in the kitchen downstairs.",
    "floor": 0,
    "name": "C4",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/I/I4",
    "allocations": {
      "2012": "Luting Chen",
      "2013": "Olivia Mckay",
      "2014": "Luting Chen"
    },
    "bathroomsharing": 1,
    "body": "A decent sized room (considering it's a fresher room), great eduroam reception :) loads of holiday storage above a big wardrobe, the kitchen is just next door (although the fridge is really small). \n\nThere is a small walkway when u walk into the room, which makes the room even more spacious. \n\nBut in general the room is really big and nice, almost nothing to complain about.",
    "floor": 1,
    "name": "I4",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J12",
    "allocations": {
      "2012": "Kamila Kingstone",
      "2013": "Joseph Mullally",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Fairly small room but comfortable. Very large amount of storage space. If you have a lot of stuff this could be the room for you! The over head lockable storage is excellent for the holidays and the extra cupboard could (almost literally) sleep 3 people in it.\n\nPositioning of the furniture can be a bit tricky due to the lack of space but can be just about managed reasonably.",
    "floor": 3,
    "name": "J12",
    "parentid": "/J",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F3",
    "allocations": {
      "2012": "Julija Stukalina",
      "2013": "William Fitzalan Howard",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Ground floor, really really noisy because it faces into college. Lots of passersby and drunken groups trooping past - not private. OK size room but Wi-Fi is iffy. Is always noisy in the morning (8/9am) as it's right next to the bedder's cupboard.. and they can be loud. Doesn't let in much light: half the room is always a bit dark, and the front door doesn't close by itself. Kitchen is one floor down. A couple of spiders. Noisiest neighbours ever.",
    "floor": 0,
    "name": "F3",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B14",
    "allocations": {
      "2012": "Lucas Birrell-Gray",
      "2013": "Thomasina Perera",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "B14",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/D/D18",
    "allocations": {
      "2012": "Evan Herbert",
      "2013": "Basil Woods",
      "2014": "Benjamin Hancock"
    },
    "bathroomsharing": 2,
    "body": "Nice room with good open floor space (it's rectangular); all the usual stuff is here and not much else. Balcony shared with E15. Three flights of stairs up so a bit of a pain at the start/end of term, but nice and close to D-staircase top kitchen which is up one more flight. Fairly good view (over Clare Hall) but it doesn't beat the garden. The room gets a lot of direct sunlight in the summer, so much so that you might want to consider moving the desk from its default position next to the window so that you don't go blind. It's great if you're an ardent user of solar-powered calculators. Compared to other rooms on this level, D18 gets very few ladybirds (or indeed other insects), although I was caught off-guard one day when the biggest bee I've ever seen in my life casually blundered through the window.\n\nAll in all, the room's pretty good, and I'd recommend it to anyone wanting a normal Standard room. If you want any more info, feel free to email me (cn319), but I don't live here any more, so I can't arrange a visit!\n\nClive (inhabitant 2009-10)",
    "floor": 3,
    "name": "D18",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/F/F8",
    "allocations": {
      "2012": "Michael Taplin",
      "2013": "Matthew Cottell",
      "2014": "Will Tremellen"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "F8",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/A/A11b",
    "allocations": {
      "2012": "Peter Judge",
      "2013": "Henry Brereton",
      "2014": "Ed Royall"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 2,
    "name": "A11b",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-12",
    "allocations": {
      "2012": "Robert Richardson",
      "2013": "Kai Man Cheung",
      "2014": "Jack Sibley"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 12",
    "parentid": "/6AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E16",
    "allocations": {
      "2012": "Luke Main",
      "2013": "Niamh Spence",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "With sweeping garden views this room is perfect for people who like to observe trees and grass from a safe distance. Has a nice balcony shared with D staircase, perfect for putting beer on. Kitchen up one flight of stairs; locker above wardrobe for holiday storage. Can get quite dark as there is little direct sunlight. Perfect for vampires or hangovers. The suggestion made by \"The Brick\" that Satan himself lives here was very much exaggerated.",
    "floor": 3,
    "name": "E16",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-4",
    "allocations": {
      "2012": "David Burnside",
      "2013": "Anthony Wong",
      "2014": "Douglas Robinson"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 4",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-9",
    "allocations": {
      "2012": "Matthew Chambers",
      "2013": "Michael Panayi",
      "2014": "Anthony Wong"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9",
    "parentid": "/6AR",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/E/E13",
    "allocations": {
      "2012": "Kezia Burkett",
      "2013": "Sam Hancock",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Garden facing with a weird main light that means the room is exceptionally bright. It's a good sized ensuite room, sharing a balcony with a room on F, with both the wardrobe and bathroom separate from the main bedroom..The wardrobe is massive with a generously sized over-head locker perfect for holiday storage. The bathroom has a handy shelf for toiletries etc and an awesomely powerful shower, bath's a bit scratchy though. The room itself has quite a few shelves and is a delightful shade of green. The internet cable socket thingy is in a bit of an awkward place under the shelves but you can just about connect a cable to a computer on the desk with a bit of furniture shuffling. Generally really liked it here, any questions email Rhiannon (rll29)",
    "floor": 2,
    "name": "E13",
    "parentid": "/E",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F12",
    "allocations": {
      "2012": "Andreas Kasis",
      "2013": "Richard Odle",
      "2014": "John Harrison"
    },
    "bathroomsharing": 1,
    "body": "It is a fair sized ensuite room, garden facing and shares its balcony, 2nd floor with E staircase. The network connection socket is on the other side of the room compared with the desk, but with a long cable it's fine. There is no mobile signal unless you stand on the balcony. There is a good amount of overhead locker storage, but unfortunately the kitchen is 2 floors above.",
    "floor": 2,
    "name": "F12",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N2",
    "allocations": {
      "2012": "Guy Sucharitikal",
      "2013": "Josh Hoskins",
      "2014": "Shrish Parmeshwar"
    },
    "bathroomsharing": 1,
    "body": "Really nice room, right above the bar (you don't have to go out in the rain to get a drink!) and with access to the massive balcony above the gardens. Wardrobe is larger than others with twice as much hanger space.\n\nYou often get the smell of smoke coming upstairs from people just outside the bar and the radiator is very noisy if on at about 12:30am and 5:30am when the heating cycles for the night. Woke me up quite a lot in Michaelmas. You can hear formal hall going on underneath you quite a lot as well as some bar noise.\n\nKitchen proximity is definitely convenient as well.",
    "floor": 1,
    "name": "N2",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/G/G3",
    "allocations": {
      "2012": "James Baker",
      "2013": "Aviv Boonin",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "G3 is a good size ensuite room. The bathroom also seems to be a fair bit larger than other ensuites which I have been in. There is a large wardrobe with drawer storage and shelving built in, along with a large amount of holiday storage space above it.\n\nThe desk is located on the same side of the room as the internet connection. Not sure whether you can get Wi-Fi here, as I don't use it, but I have a feeling you can just about get it...though probably not particularly reliably! The radiator is behind the desk, which makes it fairly...rubbish. It can, therefore, get chilly from time to time. That said, it never gets particularly bad.\n\nThe window/door opens up onto the first balcony above Front Court. This lets in a good amount of light, however it can be slightly noisy at times, especially as the bed is situated next to the window, and there's not really anywhere else for it. If you are a particularly light sleeper, this may not be for you, as you can hear fellow students returning from alcohol-fuelled revelry fairly regularly! Also, as shown on the staircase description, there is the games room on the floor below. This isn't usually an issue, except when Tai Chi classes are going on, when regular stamps on the floor and shouting are audible!\n\nAs for the general location in relation to other things, there is a kitchen on the floor, though it is particularly small, even by Robinson kitchen standards (though not as small as the one a couple of flights up!). The staircase is of course opposite the library, plodge and laundry/computer room area, which is handy. The staircase description mentions the theatre as something you might hear, but I have never noticed it except in the case of the exeptionally loud (but brilliant) Korean drumming sessions. Last of all, it only shares a wall with one room in the next staircase (unless you count the cleaning room located behind the bathroom!).\n\nSo, a short summary:\n\nPros\n----\n\n+ Fairly large, comfortable room\n+ Recieves quite a bit of light\n+ Very large storage space and wardrobe\n+ Bigger-than-average bathroom\n+ Same floor as kitchen, and close to library, plodge, laundry/comp. room.\n\nCons\n----\n\n- Faces Front Court. Not as pretty as the garden, and can be a little noisy.\n- Noise also comes from the games room from time to time.\n- Possibly no Wi-Fi.\n- Radiator positioned badly, and is thereore rubbish.",
    "floor": 1,
    "name": "G3",
    "parentid": "/G",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/G/G5",
    "allocations": {
      "2012": "Katie Fryer",
      "2013": "Emma Gerrard",
      "2014": "Weicong Chen"
    },
    "bathroomsharing": 1,
    "body": "G5 is a pretty damn awesome room.\n\n**Good things:** It's got a nice view of the garden with a balcony shared with one other room (H6), it's a good size, it has a big cupboard with lots of lockable storage, etc, etc, etc.\n\n**Bad things:** Creaky floor, creaky bed, creaky walls, creaky ceiling, creaky desk, creaky chairs, creaky bath. Basically this room and all its contents are, on the whole, very creaky.\n\n**Things to note:** Being NW-facing, G5 doesn't get direct sunlight, except for about an hour in the evenings towards the end of Easter term. This is good if you, like me, spent two years being blinded and boiled in south-facing rooms, but is bad if you don't like going outside to sunbathe. It's also good for if you want to face your desk towards the window.\n\nG staircase is brilliant though. Only 10 rooms are inhabited, so there are 5 to a kitchen (both of which are one floor from G5, so take your pick). It's got direct access to the gardens, it's near the library and the plodge, and it's just the right distance from the cafe/bar - close enough that it's not a pain if you forget your wallet, but far enough that the cafe isn't a looming distraction.\n\nIf you want to ask about the room, pop an email to cn319; but I don't live there any more, so I can't arrange a visit.\n\nClive (G5 inhabitant, 2011-12)",
    "floor": 2,
    "name": "G5",
    "parentid": "/G",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/B/B10",
    "allocations": {
      "2012": "Henrietta Hill",
      "2013": "Edward Cruz Cervera",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "B10",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q2",
    "allocations": {
      "2012": "Alexander Cakkos",
      "2013": "Alex Bate",
      "2014": "Michael Panayi"
    },
    "bathroomsharing": 1,
    "body": "This room was refurbished in Summer 2013. This means you want this room!\n\n**Pros**  \n<ul><li>Excellent view of garden, on shared walkway.</li>\n<li>New furnishings as of Summer 2013, with a spinny chair!</li>\n<li>Very nice bathroom with HEATED TOWEL RAIL!!! :D</li>\n<li>Good amount of holiday storage</li>\n<li>Great location, lift stops right outside the door, or no more stairs once you're on High Court. Close to bar, JCR, bike shed etc.</li>\n<li>WiFi access point outside the door</li>\n<li>Next to kitchen, recycling etc.</li>\n<li>Insane amount of plug sockets <del>(9!)</del> (10!) and network socket next to desk</li>\n<li>Guest room next door, so less noise from room parties</li>\n<li>Lots of floor space for people, clothes, paper...</li>\n</ul>  \n**Cons**\n<ul>\n<li>You can just about hear the music in the bar once it gets loud, particularly on karaoke nights. Don't think it would stop you from falling asleep though.</li>\n<li>Sometimes you get people having conversations on the walkway outside</li>\n<li>Not quite high enough to get a good amount of natural light</li>\n</ul>\n\nSeriously though, this room is **very** nice, and a great choice if you want a Standard Plus room.\n\nAlex (ajb300)",
    "floor": 1,
    "name": "Q2",
    "parentid": "/Q",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F3C",
    "allocations": {
      "2012": "Alice Udale Smith",
      "2013": "Jonathan Miller",
      "2014": "Louis Tam"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 3c",
    "parentid": "/flats",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M8",
    "allocations": {
      "2012": "Chris Derrick",
      "2013": "Chris Derrick",
      "2014": "Jack Walker"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "M8",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/flats/F5A",
    "allocations": {
      "2012": "Andrew Dallal",
      "2013": "Justin Shee",
      "2014": "Luke Martin-Fuller"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 5a",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "name": "Room 7 (Fellow's/Graduate)",
    "parentid": "/1AS",
    "type": "room",
    "bathroomsharing": 0,
    "rentband": 0,
    "floor": 0,
    "_id": "/1AS/1AS-7",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/H/H4",
    "allocations": {
      "2012": "Kirupakaran Arun",
      "2013": "Kayani Kayani",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "General Information\n-------------------\n\nLockable Overhead locker: Yes\nShelves: 4\n\nAs with H1 the balcony is the walkway. This is great if you like being distracted by people walking past, drunken people in the early hours talking in front court, the crazy runaway maintenance/bedders trolley at 8am or if you wish for an easy escape route in the event of a fire or zombie apocalypse (or assassination attempt if you're into that kind of thing).\n\nTwo desk chairs are provided. They do not have wheels, an adjustable height or any concept of comfort.\n\nThe radiator is located behind the desk, making it particularly difficult to dry clothes and particularly easy to melt computer cables. The room also potentially has the best view of the library in college.\n\nBathroom\n--------\n\nThe hot knob on the bath is detachable.\nThe extraction vent is mould-less (Which is better than can be said for the J13, J14, J15 bathroom last year.)\nBin included.\n\nKitchen\n-------\n\nThe modestly sized (room for at least one person) kitchen is on the same floor. The freezer door has broken off.",
    "floor": 1,
    "name": "H4",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-10",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 10 (Fellow's Room)",
    "parentid": "/5AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "name": "Q3 (Guest Room)",
    "parentid": "/Q",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 1,
    "_id": "/Q/Q3",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/sets/S21A",
    "allocations": {
      "2012": "Justin Shee",
      "2013": "Alexander Cakkos",
      "2014": "Vivek Sharma"
    },
    "bathroomsharing": 2,
    "body": "Pretty nice room overall.\n\nShared bathroom off hallway. Front door on balcony overlooking river and back-door of Set 24. ;)",
    "floor": 2,
    "name": "Set 21a",
    "parentid": "/sets",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-20",
    "allocations": {
      "2012": "Emma Hildyard",
      "2013": "Mark McGill",
      "2014": "Niamh Spence "
    },
    "bathroomsharing": 0,
    "body": "**Pros:**\n\nThe rooms on this floor are some of the biggest in the standard price bracket in the college.\n\nThere are only 3 people per bathroom, which is a good ratio for the houses.\n\nThe kitchen has a real oven!\n\nThere is only one small window (albeit with a crack in it).\n\n**Cons:**\n\nVery little noise gets through from the adjacent rooms, but you will hear EVERYTHING from the corridor.\n\nThe shower is poor at best, very much a binary temperature system and sometimes it gives up completely with the water pressure being reduced to a dribble.\n\nIt is a 2 minute walk from the main college.\n\nThe 2nd floor kitchen has a weird sloping ceiling, that chances are (unless you're 5ft or less) you will hit your head on several times over the course of the year.",
    "floor": 2,
    "name": "Room 20",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-17",
    "allocations": {
      "2012": "Liam McDonnell",
      "2013": "Becky Price",
      "2014": "Alex Roberts"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 17",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-10",
    "allocations": {
      "2012": "Christopher Palmer",
      "2013": "Benjamin Barna-Laue",
      "2014": "Dani Ismaliov "
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 10",
    "parentid": "/6AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-2",
    "allocations": {
      "2012": "Emma Noughton",
      "2013": "Jin-Min Yuan",
      "2014": "Priyesh Patel"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 2",
    "parentid": "/5AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/S/S11",
    "allocations": {
      "2012": "Gunsu Han",
      "2013": "Gunsu Han",
      "2014": "Favorite Frizell"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "S11",
    "parentid": "/S",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-15",
    "allocations": {
      "2012": "Laurence Dudley",
      "2013": "Emily Shaw",
      "2014": "Emily Shaw"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 15",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-12",
    "allocations": {
      "2012": "Hannah Dillon",
      "2013": "Alex Biondini",
      "2014": "Christine Zhou"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 12",
    "parentid": "/2AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A20",
    "allocations": {
      "2012": "Vivek Sharma",
      "2013": "Maximilian Maher",
      "2014": "Henrik Wetter-Sanchez "
    },
    "bathroomsharing": 3,
    "body": "Despite sharing a bathroom with two other rooms this room is charged as a Standard room as it's the same size as other standard rooms in college. It has a fairly good wardrobe size but no lockable cupboard for storage over the holidays. It's very convienient for the kitchen which is right next door and a decent size compared to some of the other kitchens in college. \n\nThere's no wifi but the cable plugs in right by the desk so there is no problem with that. \n\nIt's the furthest away from the bar/canteen but this does mean that it's very quiet at night and it's easier to work here then if you are in a room on a walkway.",
    "floor": 4,
    "name": "A20",
    "parentid": "/A",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A13",
    "allocations": {
      "2012": "Kate Fairhurst",
      "2013": "Charlotte Franklin",
      "2014": "Rebecca Lee"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "A13",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/F/F11",
    "allocations": {
      "2012": "Edward Cruz Cervera",
      "2013": "Amadeus Carnegie",
      "2014": "Hugh Burton"
    },
    "bathroomsharing": 1,
    "body": "Average sized room. Shares a balcony with someone on E staircase. Could complain about the lack of shelving in the bathroom, the distance from the kitchen (2 flights of stairs up and 3 down) and the slightly small wardrobe so not much storage space, but it's an alright room overall. And there's a brand new toilet seat in the bathroom. Excellent! (now 2 years old...)",
    "floor": 2,
    "name": "F11",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-9",
    "allocations": {
      "2012": "Sean Walsh",
      "2013": "Lawrence Barratt",
      "2014": "Sian Cotton"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 9",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/A/A12",
    "allocations": {
      "2012": "Rachel Burd",
      "2013": "Freddie Ashford",
      "2014": "Jonathan Ellis"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "A12",
    "parentid": "/A",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/G/G11",
    "allocations": {
      "2012": "Lucy Jenner",
      "2013": "William Yeeles",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Beautiful room:\n\n * Really light\n * If re-arrange house keeping's bizarre room arrangement, is spacious and cosy at the same time.\n * Nice view, potentially best in college\n * In summer, you can see who is on the lawn having lunch before deciding when to go down\n * Kitchen (v small) down 1 floor, only bad thing\n * No holiday storage\n * Nice light bathroom and toilet\n * Staircase right opposite library\n * Handy exit at bottom of stairs into garden\n * 4 flights of stairs....but worth it for the haven at the top",
    "floor": 4,
    "name": "G11",
    "parentid": "/G",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G/G10",
    "allocations": {
      "2012": "Emily Shaw",
      "2013": "Daniel Voller",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "This room is great! It's a really good size and layout & it has SO much natural light. Because it's on a bend it has 3 windows :) \n\nNo lockable storage space for over the holidays, which is slightly annoying, but fine. You have to walk up about 65 steps to get up here, which is annoying but sure does get you fit fast! Great views of the gardens from the room's balcony.\n\nAll in all, a lovely room that anyone should be happy to live in.",
    "floor": 4,
    "name": "G10",
    "parentid": "/G",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/O/O8",
    "allocations": {
      "2012": "James Scholes",
      "2013": "Jack Walker",
      "2014": "Dylan Sidle"
    },
    "bathroomsharing": 1,
    "body": "Good sized ensuite with a good amount of sunlight during the day. Second floor up so, even though it's walkway facing, you don't often get people going past. Directly above the bar so can get a little bit of noise when there's karaoke or something on, or when Simon is lugging the beer crates around, but never anything to get too upset about. O staircase also seems to host a piano player somewhere, which can sometimes be a bit of a pain. But most annoying is the infrequent, but ridiculously LOUD, mechanical whirring noise that comes from somewhere below (think it's a fan or something). The wardrobe is only two door, with minimal holiday storage. All really minor gripes and the room is ideally situated in respect of the cafe bar and Garden Restaurant.",
    "floor": 2,
    "name": "O8",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R8",
    "allocations": {
      "2012": "Vasilis Ioannou",
      "2013": "Emma Naughton",
      "2014": "Elliot Stevens"
    },
    "bathroomsharing": 1,
    "body": "On the whole R8 is a pretty good place. There is quite a lot of space in the actual room itself, but the wardrobe is quite small. The shower pressure is immense; having a wash is like getting roundhouse-kicked in the face by Chuck Norris. The water temperature control is also quite erratic, with a slight turn of the hot tap transforming luke-warm joy into first degree burns. Both the toilet and the sink perform well in most tested scenarios. The room itself overlooks high court, with a splendid view of Nick Milne's minions at work. \n\nedit - has just been refurbished, along with rest of R and S. Clean bathroom, floor, curtains, walls etc.",
    "floor": 2,
    "name": "R8",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/sets/S29A",
    "allocations": {
      "2012": "Harry Keevil"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 1,
    "name": "Set 29a (disabled carer)",
    "parentid": "/sets",
    "rentband": 0,
    "type": "room",
    "weight": 1
  },
  {
    "_id": "/5AR/5AR-14",
    "allocations": {
      "2012": "Steve Gordon",
      "2013": "Barney Woodhouse",
      "2014": "Patrick Roddy"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 14",
    "parentid": "/5AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/B/B3",
    "allocations": {
      "2012": "Abigail Harris ",
      "2013": "Tim Arens",
      "2014": "Clare Dawson"
    },
    "bathroomsharing": 1,
    "body": "Really nice room - one of the largest available as standard plus and the ensuite is lovely. Lots of plugs around the room. The wardrobe and overhead cupboard space is considerably larger than most other rooms. Only real issue is the fact that the windows steam up every morning but that is true of all ground floor rooms on this side of college at least. Not an amazing view but the road is fairly obstructed by trees etc, so not a big problem. Wifi can be a bit touch-and-go sometimes so you need a ethernet cable.",
    "floor": 0,
    "name": "B3",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J5",
    "allocations": {
      "2012": "Katherine O'Neill",
      "2013": "Adam Tyrcha",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Quite a good sized ensuite room, although in an L shape, which makes it feel a bit smaller. There's a small built in wardrobe between the two doors but not much hanging space. There's one lockable cupboard above the wardrobe for holiday storage like most rooms.\n\nThe window opens onto walkway which can be a bit annoying sometimes, but its not usually a problem, although it can get quite a lot of noise from front court. Not great for daylight as the front of college blocks out a lot, but it does look out onto the stained glass window of the chapel which is quite nice.",
    "floor": 2,
    "name": "J5",
    "parentid": "/J",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H2",
    "allocations": {
      "2012": "Alex Johnson",
      "2013": "Christine Zhou",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "On the same floor as the kitchen which is handy so you don't really need your own mini fridge. Also good that it's first floor - not many stairs and nice view over the gardens. The balcony goes around the whole side of the building and the bit outside this room is really wide so potentially good for the summer. There's a smallish cupboard above the wardrobe that can be locked with a padlock over the holidays to store things which is very useful.",
    "floor": 1,
    "name": "H2",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/E/E15",
    "allocations": {
      "2012": "Lawrence Barratt",
      "2013": "Bethany Smith",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "From the 2009/10 owner: E15 is a marvellous room! Although the view is not garden facing you are high up enough to see over the building opposite so you get a bit of a green view. The balcony door is a bit funny and needs a good push now and again but you'll get used to it. Everything else is pretty standard although there's a small pot noodle stain on the carpet (sorry future room owners). Also, never a problem with noise (you don't hear pianos), its near the kitchen and Satin is alleged to live next door in E14. The balcony is shared the with the owner of D18.",
    "floor": 3,
    "name": "E15",
    "parentid": "/E",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-19",
    "allocations": {
      "2012": "Ivan Gostev",
      "2013": "Ivan Gostev",
      "2014": "Grace Atkinson"
    },
    "bathroomsharing": 0,
    "body": "Room 19:\n\nApparently the best room in the grad house --\n\nBring a bright light like most rooms in college, this room has windows on two sides, but they're a little small. Room is a good size, space for 4 chairs, 2 tables, a desk, 2 shelves, wardrobes, sink...\n\nSeems quite good compared to most rooms - it's looking a little tired, but then it is a student room in college!\n\nLocation: may put you off, 5 mins from food (ie canteen)\nNoise: fine if you know who you're living with, just don't live adjacent to party people! I imagine similar to the other houses for general noise insulation...\n\nOverall happy! (I was top of room ballot so anything else would have been a failure...)",
    "floor": 2,
    "name": "Room 19",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C12",
    "allocations": {
      "2012": "Sarah Pamenter",
      "2013": "Konstantin Roder",
      "2014": "Henry Pritchard"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "C12",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N8",
    "allocations": {
      "2012": "Edward Osborne",
      "2013": "Ed Osbourne",
      "2014": "Ed Osborne"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "N8",
    "parentid": "/N",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L9",
    "allocations": {
      "2012": "Henry Brereton",
      "2013": "Dylan Sidle",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Bed is positioned next to the wall, other side of which is the shower/sink - can get frustrating if the occupant of L10 enjoys singing very loudly whilst washing.\n\nWindow looks out onto the impending doom of the UL tower which can be mildly depressing at times. Shares a balcony with someone on K staircase. Balcony position very useful for seeing if people have started queuing for brunch, or to throw things at people in the smoking area.\n\nNo holiday storage. Strong Wifi (Lapwing) which is a bonus.\n\nThere was initially no mirror fixed to the wall. I bought a fancy new one and didn't take it home with me - if you're lucky it may well still be there. If not, maintenance said they'll give you a new one in exchange for a packet of HobNobs.\n- It's still there. I thought maintenace was being extremely nice.\n\nClosest kitchen is up one flight of stairs on the top floor.\n\nThere are hooks in the walls for anybody with large frames.",
    "floor": 3,
    "name": "L9",
    "parentid": "/L",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/P/P10",
    "allocations": {
      "2012": "Zachary Levin",
      "2013": "Andreas Papadogiannakis",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "P10",
    "parentid": "/P",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/Q/Q6",
    "allocations": {
      "2012": "Zachary Shear",
      "2013": "Jess Foulds",
      "2014": "Ashleigh Morton"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "Q6",
    "parentid": "/Q",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/I/I7",
    "allocations": {
      "2012": "Georgie Straughan",
      "2013": "David Rattigan",
      "2014": "Gaby Harrison"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "I7",
    "parentid": "/I",
    "rentband": 3,
    "type": "room"
  },
  {
    "name": "G7 (Medical Resource Room)",
    "parentid": "/G",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 3,
    "_id": "/G/G7",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/O/O9",
    "allocations": {
      "2012": "Mehdi Goudarzi",
      "2013": "Daniel Chatfield",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Lighting is pretty terrible although I guess if I could be arsed to ask the porter I'm sure it would be sorted. View of UL is quite nice, especiialy sunrise. Door/window thing doesn't leak which is always a plus.\n\nBed is very squeaky as two of the slats have broken (again I could probably get this fixed if I wanted to).\n\nWifi signal is strong (although the wifi is patchy as hell right now so I stick to wired).",
    "floor": 3,
    "name": "O9",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/C/C1",
    "allocations": {
      "2012": "Ewan McGregor",
      "2013": "Fiona Howells",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Nice view of the garden - but this does mean it can get dark and dingy (two plants have died from lack of light). Very cold in winter. No wifi signal, but phone signal only good near window. There is holiday storage above the wardrobe, but this is in the hallway outside the main room and is a bit on the small side, especially considering the massive room.\nAlso handy for the kitchen, which is just opposite.",
    "floor": -1,
    "name": "C1",
    "parentid": "/C",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H1",
    "allocations": {
      "2012": "Ahmed Nisar",
      "2013": "Luke Martin-Fuller",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "Good sized room, with a reasonable sized overhead locker for storage during the holidays. Balcony is the walkway, so doesn't really have a balcony, and can sometimes be distracting when people are constatntly walking past. Also problematic in terms of a privacy/natural light trade-off. I went for nudity over sunlight. Opposite the library, not the best view but possibly the required inspiration to do some work. On the same floor as the kitchen, which is handy and not many stairs to climb to reach it. Plenty of light. All in all a pretty decent room.\n\nIncidentally, Robert Webb once lived in this room.",
    "floor": 1,
    "name": "H1",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L5",
    "allocations": {
      "2012": "Katherine Somerville",
      "2013": "Nadia Kaheil",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "General Information\n-------------------\nThe room is reasonably sized and fairly standard for a standard plus. The available balcony doubles up as a walkway to other staircases, but is occasionally used by others. However as it is the second floor, far fewer people will pass by the room, meaning oppurtunities to catch people and accuse them of tresspassing are limited.\n\nViews range from a wall, to another wall, to the university library if viewed from certain angles. One of the balcony lights shines slightly off centre to the window, acting as either a nightlight or an annoyance.\n\nLike a lot of the rooms in L staircase, the floor is very squeeky in the middle. As worrying at this may sound, it at least appears to be structurally sound as I have yet to fall through the floor into the room below and extensive tests have been made to make sure that this will not happen.\n\nThe room comes with bed included (some assembly may be required). There are also some walls and a ceiling.\n\nBathroom\n--------\nThe bathroom is fully functioning for the most part, although the hot water doesn't seem to work before about 9:00 which is obviously no good if you have early lectures. The mirror is not above the sink and is on a different wall instead, often resulting in an increased mess on the floor. There is a ridge on the floor that water has a habit of accumlating into. Unlike some other rooms, the showerhead is firmly attached and will not fall on your head at the end of your shower. The toilet flushes.\n\nKitchen\n-------\nThe kitchen is located almost directly beneath the room and contains enough room for one person, so long as they are under 6 ft tall. The fridge has the unusual ability to chill meats (and only meats) to sub zero temperatures. It has also been known to make food vanish, but this is probably due to food thieves. Contrary to popular belief, the microwave can be used as an oven.",
    "floor": 2,
    "name": "L5",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/Q/Q5",
    "allocations": {
      "2012": "Andrew Shipley",
      "2013": "Willam Shackleton",
      "2014": "Emily Lodge"
    },
    "bathroomsharing": 1,
    "body": "Decent holiday storage and hanging space (its got a little corridor with wardrobes & overhead locker as you walk in like quite a few rooms do). The bathroom has a handy shelf above the toilet and sink. Got a balcony shared with someone on P staircase. Doesn't currently get Wifi (strong enough to make much use of anyway). Balcony is standard size, but has been known to hold 30 people (Ryan counted) and the Porters don't like it if you get portered by a guest...\n\nHannis (jwfw2).\n\n![View from balcony][1]\n\n\n  [1]: http://i.imgur.com/40Gy7.jpg",
    "floor": 2,
    "name": "Q5",
    "parentid": "/Q",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/sets/S29B",
    "allocations": {
      "2012": "Harry Llanwarne"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 1,
    "name": "Set 29b (disabled)",
    "parentid": "/sets",
    "rentband": 0,
    "type": "room",
    "weight": 1
  },
  {
    "_id": "/2AR/2AR-11",
    "allocations": {
      "2012": "Emily Binning",
      "2013": "Jacob Waller",
      "2014": "Jess Dealey"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 11",
    "parentid": "/2AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/B/B4",
    "allocations": {
      "2012": "Jonathan Coote",
      "2013": "Jonathan Coote",
      "2014": "Alex Maynard"
    },
    "bathroomsharing": 1,
    "body": "As you go into the room the bathroom door and the wardrobe are on either side, then you go through the inner door to the rest of the room. 3-door wardrobe with big overhead locker so plenty of holiday storage. Only problem with bathroom is it doesn't have a big shelf behind the sink. Room is light with desk by the balcony doors, which open onto walkway (but people very rarely walk past). Nice view of the gardens. B staircase is fairly quiet, no noise form bar/bops. Rooms either side have pianos, but it's not ususally a problem",
    "floor": 0,
    "name": "B4",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/J/J6",
    "allocations": {
      "2012": "Gareth Cottiss",
      "2013": "Bryn Coldwell",
      "2014": "Rose Maxwell"
    },
    "bathroomsharing": 1,
    "body": "Benefits:\n\n + colour of the walls. Sounds weird, but it's actually a great lilac colour that is really lovely.\n + good view of the trees and the bridge; babbling brook sounds for those who are particularly water-mad.\n + Whoever was in this room before me left lots of hooks all over the place, rather handy.\n + Shower is of good intensity.\n\nBurden: \n\n - spiderwebs in the crook of the balcony window that just DO NOT GO AWAY - and be sure to keep your window closed at night, the amount of insects that invade your room (and then dive into your lamps to die) is ridiculous.\n - The outer door is about half an inch off the floor - maintenance have put a draught excluder on but it still lets out a bit of heat, and noise from J staircase filters in a fair bit.\n - The light in the main room is a bit dim.",
    "floor": 2,
    "name": "J6",
    "parentid": "/J",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O2",
    "allocations": {
      "2012": "Toby Hayward-Butcher",
      "2013": "Valentine Tongo",
      "2014": "Henry Jiao"
    },
    "bathroomsharing": 1,
    "body": "Upside:\n\n- pretty spacious\n- nice garden view\n- mild to strong wifi reception\n- right above college bar!\n\nDownside:\n\n- coming with proximity to the bar is noise.\n- balcony is shared.\n- wardrobe area lacks lighting.\n- book racks and the desk are on the opposite sides of the room.\n\njky20",
    "floor": 1,
    "name": "O2",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P2",
    "allocations": {
      "2012": "Stephanie Brown",
      "2013": "Stoyan Stoyanov",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "P2",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O14",
    "allocations": {
      "2012": "Maria Farrimond",
      "2013": "Yojan Patel",
      "2014": "Chris Barton"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 4,
    "name": "O14",
    "parentid": "/O",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/K/K10",
    "allocations": {
      "2012": "Jack Eckersley",
      "2013": "Timothy Pennington",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "No lockable cupboard. Must have one of the best views from its balcony in college. There is a lift on K, so being on the fourth floor isn't a bad thing, just means it is quieter :)",
    "floor": 4,
    "name": "K10",
    "parentid": "/K",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/P/P6",
    "allocations": {
      "2012": "Mimi Kyprianou",
      "2013": "Carlos Vazquez Bennassar",
      "2014": "Richard Allitt"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "P6",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-2",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 2 (Fellow's Room)",
    "parentid": "/4AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-2",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 2 (Fellow's Room)",
    "parentid": "/6AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/B/B12",
    "allocations": {
      "2012": "Joe Pritchard",
      "2013": "John Harrison",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "B12",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M2",
    "allocations": {
      "2012": "Chengzhang Quan",
      "2013": "Chengzhang Quan",
      "2014": "Bryn Coldwell"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "M2",
    "parentid": "/M",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/K/K3",
    "allocations": {
      "2012": "Lukas Endl",
      "2013": "Harry Orchard",
      "2014": "Hugh Granger"
    },
    "bathroomsharing": 1,
    "body": "Good sized room. long and thin, as opposed to square. good over-head locker space and reasonable sized wardrobe. good location - between library and cafe. Lift is a real plus when moving in and out - even when your'e only on the first floor! Good sized kitchen on first floor. Door out to the shared balcony/walk way overlooking the gardens - if you can be bothered to buy some plastic furniture it could be lovely in the summer. Good sized bathroom - with no lingering weird smell.\nThere's no piano on the staircase which is lucky! Good wifi and phone reception. \nIt is next to the bedders' cupboard - this was only a problem in Michaelmas term as lots of bedders congregated for a coffee and a chat - I had a new bedder for Lent term and she doesn't have everyone round so it's fine! and, being opposite the chapel sometimes choir can be a bit loud - but it's quite nice to listen really \nGenerally very happy on this staircase",
    "floor": 1,
    "name": "K3",
    "parentid": "/K",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/O/O6",
    "allocations": {
      "2012": "Joshua Lomax",
      "2013": "Everest Marshall",
      "2014": "Mimi Kyprianou"
    },
    "bathroomsharing": 1,
    "body": "There is rust in the bath and sink.",
    "floor": 2,
    "name": "O6",
    "parentid": "/O",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/L/L7",
    "allocations": {
      "2012": "Jessica Tweedie",
      "2013": "Adin Samson",
      "2014": "Becca Muller"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "L7",
    "parentid": "/L",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/P/P5",
    "allocations": {
      "2012": "Piya Haria",
      "2013": "Robert Jones",
      "2014": "Tom Weir"
    },
    "bathroomsharing": 1,
    "body": "Pros:\n\n - Very close to the Bar, Garden Restaurant, JCR etc.\n - Refurbished Summer 2013: new bathroom with heated towel rail, new desk chair and armchair, new carpet, new mattress, new kettle, new blackout curtains.\n - Morning sun, light room\n - Some holiday storage\n - Plenty of shelving\n - Strong Wi-Fi Signal\n\nCons:\n\n - Not a particularly quiet room: music can be heard from the bar on some evenings\n - On a walkway, rather than a balcony (although you're on the second floor so its not too busy)\n - Small cupboard\n - If you cook, the kitchen is on the floor below",
    "floor": 2,
    "name": "P5",
    "parentid": "/P",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/H/H6",
    "allocations": {
      "2012": "Sambavi Sritharan",
      "2013": "Cameron Gardner",
      "2014": "Holly Carter"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "H6",
    "parentid": "/H",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-6",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 6 (Fellow's Room)",
    "parentid": "/5AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "name": "F17 (Fellow's Room)",
    "parentid": "/F",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 3,
    "_id": "/F/F17",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/S/S2",
    "allocations": {
      "2012": "Eleanor Brodie",
      "2013": "Abigail Li",
      "2014": "Martin Weston"
    },
    "bathroomsharing": 1,
    "body": "S2 is a good sized ensuite room. It has a large wardrobe along with a larger amount of holiday storage. The room is a bit of an awkward shape, but comes with two sets of windows. It's on the end of the college so only shares a wall with one other room. The balcony is the 1st floor back walkway, which happens to be quite large outside S2. As for daylight, it's not fantastic as the balcony of the room above blocks out some of the light but it's alright. The network connection socket is on the other side of the room compared with the desk which is a pain, but you can just about get wireless if you put your laptop on the floor!\n\nAny questions, feel free to email me on lw358\n\nLuke",
    "floor": 1,
    "name": "S2",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/R/R4",
    "allocations": {
      "2012": "Farhan Hanif",
      "2013": "Elliot Stevens",
      "2014": "Mike Antony"
    },
    "bathroomsharing": 1,
    "body": "Good room that stays fairly cool in Summer (east facing). Only downside is the less than inspiring view of the Catering Office.",
    "floor": 1,
    "name": "R4",
    "parentid": "/R",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1AS/1AS-11",
    "allocations": {
      "2012": "Nathan Procter",
      "2013": "Hannah Day",
      "2014": "Thomas Bemment"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 11",
    "parentid": "/1AS",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/1S/1S-3",
    "allocations": {
      "2012": "Samuel Hills",
      "2013": "Samuel Hills",
      "2014": "Charlotte Hensman"
    },
    "bathroomsharing": 0,
    "body": "- Big room with 2 windows and a set of double doors onto a patio, all facing the garden, so good daylight.\n - No ensuite or sink, but there is a toilet across the hall and a bathroom upstairs\n - There is a large wardrobe, so lots of hanging space, and a dresser with some drawers for folded clothes.\n - No vacation storage in the room.\n - Furniture: wardrobe, dresser, 1 coffee table, 1 chair, (as well as 1 desk chair, desk, bed, bookshelf, bedside table)\n - Wifi router outside the door can be fairly noisy\n - Next to kitchen\n\nA (now slightly dated) 360 degree view of the room (flattened, so imagine rolling it into a circle)\n![360 Panorama][1]\n\n\n  [1]: http://i.imgur.com/Jzsjo.jpg",
    "floor": 0,
    "name": "Room 3",
    "parentid": "/1S",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/5AR/5AR-13",
    "allocations": {
      "2012": "Alex Walmsey",
      "2013": "Amy Biggadike",
      "2014": "Cameron Holloway"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 13",
    "parentid": "/5AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-7",
    "allocations": {
      "2012": "Sophie Bauer",
      "2013": "Annie Richardson",
      "2014": "Adam Runacres"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 1,
    "name": "Room 7",
    "parentid": "/4AR",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/R/R15",
    "allocations": {
      "2012": "Jennifer Honeywood",
      "2013": "Elia Orellana",
      "2014": "Benjamin Barna-Laue"
    },
    "bathroomsharing": 3,
    "body": "One of the smaller standards in college, but still room to get everything in. Has a nice view of the gardens, bridge and Adams Road houses. Unfortunately there is only one potential bed space which is along the wall with the kitchen on the other side, so if anyone is using the kitchen late at night, you will here it. No overhead locker for vacation storage. Room is really warm, even when the radiator is on low in winter, because it gets sun all day. However, the sun shines straight onto the desk so you need to have one of the curtains closed during the middle of the day to avoid blindness. Overall, a pretty decent room, but nothing special.",
    "floor": 4,
    "name": "R15",
    "parentid": "/R",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/S/S6",
    "allocations": {
      "2012": "Iffeyinwa Frederick",
      "2013": "Ahmed Nisar",
      "2014": "Jack Eckersley"
    },
    "bathroomsharing": 1,
    "body": "Big for a Standard Plus room. Loads of floor space, handy shelves and an overhead locker above the wardrobe. Heavy door to separate main room from wardrobe/bathroom area in case of zombie outbreak. The window faces the balcony of Set 30, so if you know the people living there you can communicate via frantic semaphore.\n\nBeing on the end of High Court, it's a bit out of most people's way. But it's also really, really quiet, even with the Music Room right there. You can hear the Bops, but then so can people in Norway. Wifi access is there but very weak, you're better off with a cable. Although it could be that my computer is just rubbish.\n\nAs of 17/05/10, this room has been officially designated a Sex Designated Terrain by the RCSA President, which may slightly reduce its market value.",
    "floor": 2,
    "name": "S6",
    "parentid": "/S",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/1S/1S-2",
    "allocations": {
      "2012": "Mary Hughes",
      "2013": "Ruairi Dorrity",
      "2014": "Rebecca Oldham"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 2",
    "parentid": "/1S",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-15",
    "allocations": {
      "2012": "John Mulvey",
      "2013": "Andrew Witty",
      "2014": "Georgie Edmonds"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 15",
    "parentid": "/6AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/B/B20",
    "allocations": {
      "2012": "Alex Himsworth",
      "2013": "Rogelio Luque-Lora",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 4,
    "name": "B20",
    "parentid": "/B",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/D/D16",
    "allocations": {
      "2012": "Jasper Joyce",
      "2013": "Lily Fitzgerald",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "Ok, so this might be a little out of date, because I lived there in 2008/9. But here goes.\n\nD16 is a pretty good example of a standard price band shared bathroom room. It is garden facing, which is better, because the ones on that side of college are slightly bigger and also have the overhead lockable storage that D15 and others of that type don't have. And it doesn't get stupidly hot in the summer, because it's North facing. D staircase is a bit of a walk from anywhere worth being in college, but its not a proper trek, so its tolerable.\n\nI liked it so much that I got another similar room (I10) this year. More excitingly however, D16 is better than I10 for several reasons.\n\n1. The walls are the more attractive pale yellow colour rather than the blue.\n2. The mirror is on the wall by the wardrobe, sensible if you want to look at yourself as you put on your clothes.\n3. With the desk in the position it is supplied in, you only need a short cable to attach your laptop to the handily located socket.\n4. Unless whoever lives there this year manages to lose it, this room still has its kitchen cupboard key. So you can leave your pasta in the kitchen with the confidence that it is safely locked away.",
    "floor": 3,
    "name": "D16",
    "parentid": "/D",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-10",
    "allocations": {
      "2012": "Katie Harries",
      "2013": "Frederick Powell",
      "2014": "Ryutaro Ikeda"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 2,
    "name": "Room 10",
    "parentid": "/4AR",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-4",
    "allocations": {
      "2012": "Emily Fernandes",
      "2013": "Ioana Popovici",
      "2014": "Ioana Popovici"
    },
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 4",
    "parentid": "/6AR",
    "rentband": 1,
    "type": "room"
  },
  {
    "_id": "/B/B9",
    "allocations": {
      "2012": "Sam Troughton",
      "2013": "Sam Kaplan",
      "2014": "Kiyanoush Mirshahi"
    },
    "bathroomsharing": 1,
    "body": "Good sized square room, plenty of storage (big 3 door wardrobe with overhead lockers for the holidays in the little hall as you go in). Ensuite. Looks onto the garden, doors onto a walkway (but no one ever walks past). Quiet area of college. Plenty of light to work in since the desk is by double patio doors. Its really easy to move in as its by the gate onto Herschel Rd, and only one flight of stairs,\n\nDownsides: Its quite far to walk to the bar/restaurant, but I'm being picky - its a really lovely room!",
    "floor": 1,
    "name": "B9",
    "parentid": "/B",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/M/M9",
    "allocations": {
      "2012": "Hannah Day",
      "2013": "Tom Latimer",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "A standard room, with a fair amount of space and front balcony. In very close proximity to the bar and Garden Restaurant, but this does mean you can hear people talking outside the bar after closing. Saying that, being on the third floor means you are actually quite far from any chatter and you should be able to go out like a light if you've been working your little cotton socks off all day long. There is no overhead storage in this room. However, there is a **simply fantastic** kettle with **serious evaporating action** that will be able to make you **hot beverages galore**!",
    "floor": 3,
    "name": "M9",
    "parentid": "/M",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/J/J3",
    "allocations": {
      "2012": "Claudia Shin-Botin",
      "2013": "Zachary Shear",
      "2014": "Adeolu Akano"
    },
    "bathroomsharing": 1,
    "body": "Great room. Really big for a college room. Good bathroom, shower has really good water pressure. Only one window which opens out onto the large first level balconies and walkways which mean it can get a bit dark given the size of the room. Other than that the only drawback is that noise from front court comes straight up if the staircase doors are left open (which is pretty much all the time). Right next door to the kitchen which is convenient but it can be noisy (and smelly if someone burns something!)",
    "floor": 1,
    "name": "J3",
    "parentid": "/J",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/F/F5",
    "allocations": {
      "2012": "Edwin Lee",
      "2013": "Sam Holmes",
      "2014": "Sam Holmes"
    },
    "bathroomsharing": 1,
    "body": "Previous complaints from fellow who lives underneath about noise\nSometimes noisy living next to the organ scholar, who plays the piano all the time\nLight level could be a bit lot better but not terrible!\nNext to the bedkeeper's cupboard....and they wake you up every morning with all their noise and non-stop talking/gossiping in Polish\nOccasional spiders (but not a problem if you like them!)",
    "floor": 0,
    "name": "F5",
    "parentid": "/F",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/2AR/2AR-7",
    "allocations": {
      "2013": "Samuel Troughton",
      "2014": ""
    },
    "bathroomsharing": 0,
    "body": "A really good room as it's a pretty decent size without feeling too empty. It's a best room so you pay quite a lot for it given that it's not as big as some other best rooms. However it is right next door to the bathroom so is basically en-suite and has access to the single best kitchen anywhere in college just downstairs (and it's only used by another 5 people). Also as it's not on the same corridor as the other rooms it is much quieter then living on the main corridor whilst still being really close to everyone else. All in all a very good room and well worth the price.",
    "floor": 1,
    "name": "Room 7",
    "parentid": "/2AR",
    "rentband": 4,
    "type": "room",
    "weight": -1
  },
  {
    "_id": "/1S/1S-14",
    "allocations": {
      "2012": "Andreas Papa",
      "2013": "James Baker"
    },
    "bathroomsharing": 0,
    "body": "This is an average sized standard room but there is a massive partition down the middle of the room on one side for no reason whatsoever, which does limit space a fair bit. It also means that you don't get much sunlight on one half of the room. Not only that but since all but one of the walls is at an angle (it's an attic room) the furniture simply doesn't fit in the room properly. No mirror.\n\nThere is an upstairs bathroom next door.",
    "floor": 2,
    "name": "Room 14",
    "parentid": "/1S",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G/G2",
    "allocations": {
      "2012": "Gen Nen Ho",
      "2013": "Francesca D'Arcy-Orga",
      "2014": "(fresher)"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 1,
    "name": "G2",
    "parentid": "/G",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N13",
    "allocations": {
      "2012": "Kuan Hsieh",
      "2013": "Samuel Carr",
      "2014": "Keir Baldwin"
    },
    "bathroomsharing": 2,
    "body": "Fair size, very light. Overhead storage in the form of a good sized loft, provided you can fit the boxes though the small opening to it (Just watch out for the insulation as it makes for extreme itchiness if it gets on your clothes. not wanting to put you off or anything...). THE BEST views of the garden from the balcony, shared with N14. Very easy access to kitchen which has a skylight to get rid of that smoke when you invariably burn your toast when hungry after a night out.   Perfect for access to Bar. cafe, garden restaurant, JCR and party room (so pretty much everything you might want to be close to), especially if it's raining (you don't have to go outside). Although above the bar, it is very quiet and you can only hear people in the bar when it's karaoke night (even then, I slept through a whole karaoke night here).\n\nIf you like 4 flights of stairs, then it is the best place to be :)\n\nBryn Pickering (bp325) 10/02/2011",
    "floor": 4,
    "name": "N13",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/G/G6",
    "allocations": {
      "2012": "Alasdair Pollock",
      "2013": "Alasdair Pollock",
      "2014": "Maximilian Maher"
    },
    "bathroomsharing": 1,
    "body": "",
    "floor": 2,
    "name": "G6",
    "parentid": "/G",
    "rentband": 3,
    "type": "room"
  },
  {
    "_id": "/N/N9",
    "allocations": {
      "2012": "Maximilian Haas",
      "2013": "Faye Lee",
      "2014": "(fresher)"
    },
    "bathroomsharing": 2,
    "body": "",
    "floor": 3,
    "name": "N9",
    "parentid": "/N",
    "rentband": 2,
    "type": "room"
  },
  {
    "_id": "/flats/F6B",
    "allocations": {
      "2012": "Daniel Anscomb",
      "2013": "Harry Brunton",
      "2014": "Brian Wang"
    },
    "bathroomsharing": 3,
    "body": "",
    "floor": 1,
    "name": "Flat 6b",
    "parentid": "/flats",
    "rentband": 4,
    "type": "room"
  },
  {
    "_id": "/4AR/4AR-1",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 1 (Fellow's Room)",
    "parentid": "/4AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "_id": "/6AR/6AR-3",
    "allocations": {},
    "bathroomsharing": 0,
    "body": "",
    "floor": 0,
    "name": "Room 3 (Fellow's Room)",
    "parentid": "/6AR",
    "rentband": 0,
    "type": "room"
  },
  {
    "name": "R2 (Guest Room)",
    "parentid": "/R",
    "type": "room",
    "bathroomsharing": 1,
    "rentband": 0,
    "floor": 1,
    "_id": "/R/R2",
    "body": "",
    "allocations": {}
  },
  {
    "_id": "/5AR",
    "body": "",
    "name": "5 Adams",
    "parentid": "Root",
    "type": "staircase",
    "weight": 4
  },
  {
    "_id": "/D",
    "body": "D staircase is on Herschel Court.",
    "name": "Staircase D",
    "parentid": "Root",
    "type": "staircase"
  },
  {
    "_id": "/4AR",
    "body": "",
    "name": "4 Adams",
    "parentid": "Root",
    "type": "staircase",
    "weight": 4
  }
]